National Portrait Gallery, Smithsonian Institution; gift of Henry Merriam Abbot, in loving memory of his great-grandfather, Henry Larcom Abbot
National Portrait Gallery, Smithsonian Institution; transfer from the National Museum of Natural History
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution; gift of Mr. and Mrs. William D. Blakemore, Midland, Texas; Mr. and Mrs. Omar Harvey, Dallas, Texas; Mr. and Mrs. R.K. Keitz, Dallas, Texas; Col. and Mrs. Thomas A.P. Krock, Dallas, Texas; Mr. and Mrs. W.R. Lloyd, Jr., Houston, Texas; Dr. and Mrs. J.R. Maxfield, Dallas, Texas; Mr. and Mrs. Wesley Nagorny, Jr., Houston, Texas; Dr. and Mrs. H.B. Renfrow, Dallas, Texas; Mr. and Mrs. J.W. Taylor, Dallas, Texas; Dr. and Mrs. J. Robert Terry, Miami, Florida; Mr. and Mrs. Thomas B. Young, Dallas, Texas; and an anonymous donor
National Portrait Gallery, Smithsonian Institution; gift of McCall Studios
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution; transfer from the Harry S Truman Library, Independence, Missouri
Union League Club, New York
The Newberry Library, Chicago, Illinois
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Harry Newton Blue; Frame conserved with funds from the Smithsonian Women's Committee
Albany Institute of History and Art, Gift of Mr. Miland G. Batcheller
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; gift of Jon R. Friedman
National Portrait Gallery, Smithsonian Institution; gift of Jon R. Friedman
National Portrait Gallery, Smithsonian Institution; gift of Gilbert Grosvenor Coville
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Julius Bien, Jr., 1920
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution; gift of Val A. Browning
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Philip Burt Fisher
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of the George Washington Carver Memorial Committee to the Smithsonian Institution, 1944
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; transfer from the National Gallery of Art; gift of the A.W. Mellon Educational and Charitable Trust, 1942
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution; gift of Mrs. John Vinton Dahlgren, Woodbine, Maryland
National Portrait Gallery, Smithsonian Institution; gift of Whitney Dall
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Albert Delafield, 1910
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution; gift of William F. Draper, descendant
Museo de Historia, Antropologa y Arte, Universidad de Puerto Rico, Recinto de Rio Piedras
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Eleanor A. Campbell to the Smithsonian Institution, 1942
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; gift of the artist
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of the Swedish American Republican League of Illinois to the Smithsonian Institution, 1912
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of the Espy family to the Smithsonian Institution, 1860
National Portrait Gallery, Smithsonian Institution; gift of Eberhard Faber
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; gift of the Morris and Gwendolyn Cafritz Foundation
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution; gift of Ruth Munson
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution; gift of Francisco Arechiga
Washington-Custis-Lee Collection, Washington and Lee University, Lexington, Virginia
National Portrait Gallery, Smithsonian Institution; gift of Ernestine Gilbreth Carey and Lillian Carey Barley
National Portrait Gallery, Smithsonian Institution; gift of the Gillette Company
National Portrait Gallery, Smithsonian Institution; gift of Time magazine
National Portrait Gallery, Smithsonian Institution; gift of an anonymous donor
National Portrait Gallery, Smithsonian Institution; transfer from the Library of Congress
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Harry Newton Blue in memory of her husband Harry Newton Blue (1893-1925), who served as an officer of the Regular U.S. Army 1917-1925
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Boris Chaliapin
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Oscar Hammerstein II through Mr. Alexander Ince
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution; Frame conserved with funds from the Smithsonian Women's Committee
Herbert Hoover Presidential Library and Museum
National Portrait Gallery, Smithsonian Institution; gift of Mendel L. Peterson
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of the National Art Committee to the Smithsonian Institution, 1923
Herbert Hoover Presidential Library and Museum
National Portrait Gallery, Smithsonian Institution
The Union League Club of Chicago
Herbert Hoover Presidential Library and Museum
National Portrait Gallery, Smithsonian Institution; gift of William T. Hornaday Conservation Trust, Inc.
National Portrait Gallery, Smithsonian Institution; gift of Kenneth I. Ives and Barbara Ives Beyer, the sitter's children
The Museum of Fine Arts, Houston; the Bayou Bend Collection, gift of Miss Ima Hogg
National Portrait Gallery, Smithsonian Institution
Courtesy of Independence National Historical Park Collection, Philadelphia, PA
Colonial Williamsburg
Independence National Historical Park
National Portrait Gallery, Smithsonian Institution; bequest of Charles Francis Adams; Frame conserved with funds from the Smithsonian Women's Committee
National Portrait Gallery, Smithsonian Institution
New-York Historical Society
Monticello Thomas Jefferson Foundation, Incorporated
Monticello Thomas Jefferson Foundation, Incorporated
The Maryland Historical Society, Baltimore, Maryland
The Virginia Historical Society
Lafayette College, Easton, Pennsylvania
Chicago Historical Society
National Portrait Gallery, Smithsonian Institution; owned jointly with Monticello, Thomas Jefferson Foundation, Incorporated, Charlottesville, Virginia; purchase funds provided by the Regents of the Smithsonian Institution, the Trustees of the Thomas Jefferson Foundation, Incorporated, and the Enid and Crosby Kemper Foundation
Philipse Manor Hall, New York State Office of Parks, Recreation and Historic Preservation
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution; gift of Eugene V. Epperly
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Dr. Edward Kellogg, 1963
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Eugene W. Kettering
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Marjorie Lea Hudson, 1961
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Willard F. Libby
National Portrait Gallery, Smithsonian Institution; bequest of Millicent Todd Bingham
National Portrait Gallery, Smithsonian Institution; bequest of Millicent Todd Bingham
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of the artist, 1910
National Portrait Gallery, Smithsonian Institution; gift of Chauncey and Marion Deering McCormick Foundation and Mrs. Gilbert Harrison
National Portrait Gallery, Smithsonian Institution; transfer from the National Gallery of Art; gift of the A.W. Mellon Educational and Charitable Trust, 1942
National Portrait Gallery, Smithsonian Institution; transfer from the National Bureau of Standards, Department of Commerce; gift of the International Nickel Corporation, 1984
National Portrait Gallery, Smithsonian Institution; gift of Michael Millikan and family
National Portrait Gallery, Smithsonian Institution; this acquisition was made possible by a generous contribution from the James Smithson Society
National Portrait Gallery, Smithsonian Institution; transfer from the National Museum of American History; gift of the Telegraphic Historical Society of North America
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; bequest of Viola Walden Myer, 1919
National Portrait Gallery, Smithsonian Institution; gift of Simon Newcomb Wilson
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; partial gift of Mrs. James Burd Peale Green
National Portrait Gallery, Smithsonian Institution; Frame conserved with funds from the Smithsonian Women's Committee
National Portrait Gallery, Smithsonian Institution; gift of Donald Hamilton Workman in memory of his father, James Clark Workman, and his grandfather, James Henry Workman
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Andrew Van Pelt
National Portrait Gallery, Smithsonian Institution; gift of Mrs. Martin Beaver
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Mrs. John Wesley Powell, 1906
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution; gift of the William Woodville Estate
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; bequest of Stanley P. Sax
National Portrait Gallery, Smithsonian Institution; partial gift of Lucia Howe Snow
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; gift of Everett Raymond Kinstler
National Portrait Gallery, Smithsonian Institution; gift of Alice Silliman Hawkes
National Portrait Gallery, Smithsonian Institution; gift of the Singer Company
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution; gift of H.H. Walker Lewis in memory of his parents, Mr. and Mrs. Edwin A.S. Lewis
National Portrait Gallery, Smithsonian Institution; gift of H.H. Walker Lewis in memory of his parents, Mr. and Mrs. Edwin A.S. Lewis
National Portrait Gallery, Smithsonian Institution; gift of H.H. Walker Lewis in memory of his parents, Mr. and Mrs. Edwin A.S. Lewis
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution; transfer from the National Archives
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Samantha L. Huntley, 1928
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum; gift of Edwin W. Dickinson, 1969
National Portrait Gallery, Smithsonian Institution
Pennsylvania Academy of the Fine Arts
Colonial Williamsburg
Winterthur Museum
Lafayette College
The Colonial Williamsburg Foundation, Virginia
Mercer Collection, Washington and Lee University, Lexington, Virginia
Brooklyn Museum of Art
National Portrait Gallery, Smithsonian Institution; gift of an anonymous donor
National Portrait Gallery, Smithsonian Institution; transfer from the National Gallery of Art; gift of the A.W. Mellon Educational and Charitable Trust, 1942
Mount Vernon Ladies Association
National Portrait Gallery, Smithsonian Institution
Mount Vernon Ladies Association
Independence National Historical Park
Wadsworth Atheneum
National Portrait Gallery, Smithsonian Institution; acquired as a gift to the nation through the generosity of the Donald W. Reynolds Foundation
The Maryland Historical Society, Baltimore, Maryland
Colonial Williamsburg
National Portrait Gallery, Smithsonian Institution; owned jointly with Museum of Fine Arts, Boston
Indianapolis Museum of Art
Pennsylvania Academy of the Fine Arts
Museum of Fine Arts, Boston
Hartford Public High School
National Portrait Gallery, Smithsonian Institution; transfer from the Smithsonian American Art Museum
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution
National Portrait Gallery, Smithsonian Institution