Detroit Museum of Art Purchase, Popular Subscription Fund
Gift of James L. Edison
Gift of the artist
Gift of the artist
Gift of Edward Chandler Walker
Detroit Museum of Art Purchase, Picture Fund
Gift of Mrs. John L. Gardner
Gift of Mrs. John L. Gardner
Gift of the Estate of James E. Scripps
Gift of the members of the First Board of Trustees of the Detroit Museum of Art
Detroit Museum of Art Purchase, Popular Subscription Fund
Gift of Charles L. Freer
Gift of Edward Chandler Walker
Detroit Museum of Art Purchase, Picture Fund
Gift of Edward Chandler Walker
Gift of the International Art Union of Paris
Gift of Charles Willis Ward
Detroit Museum of Art Purchase, William C. Yawkey Fund
Gift of Mrs. James F. Joy
Bequest of Mary M. Stevens
City of Detroit Purchase
Detroit Museum of Art Purchase, Popular Subscription Fund
Gift of Mrs. Robert Hopkin
Gift of friends of the artist
Gift of Charles Willis Ward
City of Detroit Purchase
Detroit Museum of Art Purchase, Popular Subscription Fund
Gift of A. Leonard Nicholson
Gift of Mrs. Walter Shirlaw
City of Detroit Purchase
Gift of Edward Chandler Walker
City of Detroit Purchase
Gift of David Gray
Gift of Mr. Elliott T. Slocum
Gift of Charles Willis Ward
Gift of Dexter M. Ferry, Jr.
Gift of the artist
Detroit Museum of Art Purchase, William C. Yawkey Fund
Detroit Museum of Art Purchase, Special Membership and Donations Fund with contributions from Philip, David and Paul R. Gray, and their sister Mrs. William R. Kales
Gift of Miss Julia E. Peck
City of Detroit Purchase
Detroit Museum of Art Purchase, Lizzie Merrill Palmer Fund
Gift of Mrs. George O. Robinson
Gift of the artist
Bequest of Mrs. Almeda H. Pickering
Detroit Museum of Art Purchase, Lizzie Merrill Palmer Fund
City of Detroit Purchase
City of Detroit Purchase
Founders Society Purchase, Lizzie Merrill Palmer Fund
Founders Society Purchase, Special Membership and Donations Fund with contributions from Philip, David and Paul R. Gray, and their sister Mrs. William R. Kales
Founders Society Purchase, Special Membership and Donations Fund with a contribution from Mr. J. J. Crowley
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Founders Society Purchase, Beatrice W. Rogers Fund
Bequest of Mrs. Allan Shelden III
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Gift of Betsey Mast Reid in memory of her aunt, Jane Betsey Welling
Founders Society Purchase, Dexter M. Ferry Jr. Fund
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Founders Society Purchase, Robert H. Tannahill Foundation Fund, General Membership Fund, Gibbs-Williams Fund, Laura H. Murphy Fund, Dexter M. Ferry Jr. Fund, Elizabeth P. Kirby Fund, Elizabeth and Allen Shelden Fund, Merill Fund; gifts from Charles Willis Ward, Mrs. Gustavus D. Pope, Kate Minor, Newhouse Galleries, Miss Julia E.Peck, Detroit and Wayne County Tuberculosis Foundation, Anonymous Donor, Paul H. Townsend, Mrs. John L. Gardner, City of Detroit, Elizabeth Hughes Gossett, Mrs. George Kamperman, Mrs. Theodore Chapin Beebe, Recess Club, Mrs. Benjamin Goldberg, Mr. and Mrs. James O. Keene, Mrs. Mathias J. Alten, Mrs. Arthur McGraw, Mrs. E. Murray McKay, Mr. David Gray, Percy K. Loud, Mrs. William T. Barbour, Lawrence A. Fleischman, Mrs. Henry Gallison, Lillian Henkel Haass, Archives of American Art, Mr. Phillip Gray, Mrs. William R. Kales, Mr. and Mrs Harold O. Love, Mrs. George Hendrie, Mrs. Walter Shirlaw, Harrington Fitzgerald, Mrs. Lendall Pitts, Walter Piper, Gilbert M. Frimet, Colonel Frank J. Hecker, Mr. and Mrs. Edgar B. Whitcomb, Mrs. Mary B. Longyear, Edgar P. Richardson, John S. Newberry, Miss Florence Babbit, Margaret C. Horn, Armand H. Griffith, Mrs. William E. Scripps, Anne Goldthwaite, Miss Euphemia Holden, and Mr. and Mrs. James S. Holden by exchange.
Founders Society Purchase, Eleanor and Edsel Ford Exhibition and Acquisition Fund
Gift of Dr. and Mrs. Joseph Chazan, Arthur and Joyce Hurvitz, and Irwin and Gloria Sparr in honor of Mr. and Mrs. Richard A. Manoogian
Gift of Dr. and Mrs. Joseph Chazan, Arthur and Joyce Hurvitz, and Irwin and Gloria Sparr in honor of Mr. amd Mrs. Richard A. Manoogian
Gift of Sally A. Feldman in memory of Joseph D. Feldman
Gift of Sally A. Feldman in memory of Joseph D. Feldman
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Gift of the Witenagemote Club
Gift of Ralph Harman Booth
Founders Society Purchase, gifts from Mr. Hyman M. Beale, Mr. and Mrs. James O. Keene, George G. Booth and various donors by exchange
Gift of the artist through his sister, Mrs. Ellie Stewart Brolemann
Founders Society Purchase, Merrill Fund
City of Detroit Purchase
Gift of Dr. Charles W. Hitchcock
Gift of Dr. Ernest G. Stillman
Gift of Baroness von Ketteler, Henry Ledyard and Hugh Ledyard, in memory of Henry Brockholst Ledyard
Founders Society Purchase
Gift of Richard H. Webber
Founders Society Purchase, General Membership Fund
Gift of Dexter M. Ferry, Jr.
City of Detroit Purchase
Gift of Dexter M. Ferry, Jr.
City of Detroit Purchase
City of Detroit Purchase
Gift of Ralph Harman Booth
City of Detroit Purchase
Bequest of Colonel Frank J. Hecker
Bequest of Colonel Frank J. Hecker
Bequest of Colonel Frank J. Hecker
Gift of Mr. D. J. Healy
City of Detroit Purchase
City of Detroit Purchase
Gift of Mrs. Arthur McGraw
Gift of Edsel B. Ford
Gift of Edsel B. Ford
Gift of Edsel B. Ford
Gift of Edsel B. Ford
Gift of Edsel B. Ford
Gift of the Fred Sanders Company in memory of its founder, Fred Sanders
Bequest of Henry Glover Stevens in memory of Ellen P. Stevens and Mary M. Stevens
Bequest of Dr. and Mrs. James Cleland, Jr.
Founders Society Purchase, Gibbs-Williams Fund
Gift of Mr. and Mrs. George S. Page, Blinn S. Page, Lowell Briggs Page and Mrs. Leslie Stockton Howell
Gift of Mr. and Mrs. George S. Page, Blinn S. Page, Lowell Briggs Page and Mrs. Leslie Stockton Howell
Gift of Dexter M. Ferry, Jr.
Founders Society Purchase, Dexter M. Ferry Fund
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Gift of Dexter M. Ferry, Jr.
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Founders Society Purchase, Laura H. Murphy Fund
Gift of Dexter M. Ferry, Jr.
Gift of Mr. and Mrs. William D. Biggers
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Gift of Dexter M. Ferry, Jr.
Gift of Mrs. Blanche Ferry Hooker
Gift of Mrs. Blanche Ferry Hooker
Gift of Dexter M. Ferry, Jr.
Gift of Mrs. Lillian Henkel Haass
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Gift of Dexter M. Ferry, Jr.
Gift of Henry Munroe Campbell
Gift of Dexter M. Ferry, Jr.
City of Detroit Purchase
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of Mrs. J. Bell Moran
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Gift of Mrs. H. C. Miller
Gift of Robert H. Tannahill
Gift of Dexter M. Ferry, Jr.
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of Robert H. Tannahill
Bequest of Helen Lothrop Prall
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of Dexter M. Ferry, Jr.
Gift of C. W. Churchill in memory of his father
Founders Society Purchase with funds from Dexter M. Ferry, Jr.
Gift of B. E. Ford
Founders Society Purchase with funds from Dexter M. Ferry, Jr.
Founders Society Purchase, Gibbs-Williams Fund
Gift of Dexter M. Ferry, Jr.
Gift of Mrs. Edith Gregor Halpert
Gift of Dexter M. Ferry, Jr.
Gift of the National Academy of Design, Mrs. William T. Brewster Bequest
Gift of Raymond C. Smith
Gift of Mr. and Mrs. Ernest Kanzler
Gift of Dexter M. Ferry, Jr.
Gift of the Allston Trust
Gift of Katherine French Rockwell
Founders Society Purchase with funds from Mr. and Mrs. James S. Whitcomb
Gift of Douglas F. Roby
Gift of Raymond C. Smith
Founders Society Purchase, Merrill Fund
Founders Society Purchase, Dexter M. Ferry, Jr, Fund
Gift of Mrs. Samuel T. Carson
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Director's Discretionary Fund
Gift of the Wayne County Medical Society
Founders Society Purchase, Director's Discretionary Fund
Bequest of Dexter M. Ferry, Jr.
Gift of Mrs. James Couzens
Gift of Miss Amelia Elizabeth White
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Gift of Dr. and Mrs. Irving Levitt
Founders Society Purchase, Mr. and Mrs. Walter Buhl Ford, II Fund
Bequest of Alfred J. Fisher
Gift of Raymond C. Smith
Gift of Raymond C. Smith
Founders Society Purchase, Beatrice W. Rogers Fund and funds from Robert H. Tannahill and Al Borman
Founders Society Purchase, Robert H. Tannahill Foundation Fund, Gibbs-Williams Fund, and the Merrill Fund
Bequest of Mr. and Mrs. Charles M. Swift
Bequest of Robert H. Tannahill
Founders Society Purchase with funds from Mr. and Mrs. Richard A. Manoogian
Founders Society Purchase, Gibbs-Williams Fund
Founders Society Purchase, Dexter M. Ferry, Jr. Fund
Gift of Mrs. Christian H. Hecker
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Gift of Mrs. Edsel B. Ford in memory of Robert H. Tannahill
City of Detroit Purchase, Insurance Recovery Funds
Founders Society Purchase, Gibbs-Williams Fund, Dexter M. Ferry Jr. Fund, Robert H. Tannahill Foundation Fund and Beatrice W. Rogers Fund
Gift of Mr. and Mrs. Harold O. Love
Gift of Mr. and Mrs. James O. Keene
Gift of Mr. and Mrs. James O. Keene in memory of their daughter, Sandra Mae Long
Gift of Mrs. Helen L. DeRoy
Gift of Dr. and Mrs. Sheldon Stern
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Founders Society Purchase with funds from Mr. and Mrs. Richard A. Manoogian, the Beatrice Rogers Fund, Gibbs-Williams Fund and Ralph Harman Booth Bequest Fund
Gift of Mr. and Mrs. Bernard F. Walker in memory of Jacob and Rosalie Siegel
Founders Society Purchase, Beatrice W. Rogers Fund
Founders Society Purchase, Gibbs-Williams Fund and Dexter M. Ferry, Jr. Fund
Founders Society Purchase, Gibbs-Williams Fund
Founders Society  Purchase, Robert H. Tannahill Foundation Fund, Gibbs-Williams Fund, Dexter M. Ferry Jr. Fund, Merrill Fund, Beatrice W. Rogers Fund, and Richard A. Manoogian Fund
Bequest of Eleanor Clay Ford
Founders Society Purchase, Gibbs-Williams Fund
Gift of Mr. and Mrs. Harold O. Love
Founders Society Purchase, Robert H. Tannahill Foundation Fund, James and Florence Beresford Fund, Gibbs-Williams Fund and Beatrice W. Rogers Fund
Founders Society Purchase, Robert H. Tannahill Foundation Fund
Founders Society Purchase, Robert H. Tannahill Foundation Fund and Gibbs-Williams Fund
Gift of the Estates of Edgar W. and Bernice Chrysler Garbisch
Founders Society Purchase, Beatrice W. Rogers Fund, Dexter M. Ferry, Jr. Fund, Merrill Fund, and Eleanor and Edsel Ford Exhibition and Acquisition Fund
Detroit Museum of Art Purchase, Art Loan Fund and Popular Subscription Fund
Gift of George H. Scripps
Detroit Museum of Art Purchase, Merrill Hall Exhibition Proceeds
Detroit Museum of Art Purchase
Gift of the Friends of the Museum
Detroit Museum of Art Purchase, Popular Subscription Fund
Gift of James E. Scripps
Gift of the Witenagemote Club
Gift of Mr. Bela Hubbard
Gift of Mrs. William H. Brearley
Detroit Museum of Art Purchase, Artists' Fund
Gift of the C. J. Glasgow Company
Gift of James K. Watkins, Jr., George H. Watkins, John B. Watkins and Margaret H. Watkins in memory of Mrs. James K. Watkins