Gift of Alice Pratt Brown
Museum purchase with funds provided by; the Agnes Cullen Arnold Endowment Fund
Gift of Mr. and Mrs. Meredith Long in memory of Agnes Cullen Arnold
Gift of Target Stores
Museum purchase with funds provided by; the Agnes Cullen Arnold Endowment Fund
Museum purchase with funds provided; by the Agnes Cullen Arnold Endowment Fund
Museum purchase
25th Annual Houston Artists Exhibition, museum purchase prize, 1950
Museum purchase with funds provided by; the Agnes Cullen Arnold Endowment Fund
Gift of George R. Brown in honor of his wife, Alice Pratt Brown
Gift of Mr. and Mrs. Meredith Long
The Peter Blum Edition Archive, 1980-1994; Museum purchase with funds provided; by the Alice Pratt Brown Museum Fund
Museum commission, gift of Isabel B. and Wallace S. Wilson
Gift of Target Stores
The Bayou Bend Collection; Gift of Miss Ima Hogg
Gift of Miss Ima Hogg
Gift of Miss Ima Hogg
Museum purchase
Museum purchase with funds provided by; the Agnes Cullen Arnold Endowment Fund
Gift of Marian Thompson Deininger
Gift of Miss Ima Hogg
Museum purchase with funds provided by; Helena Woolworth McCann and the Winfield Foundation,; by exchange
Museum purchase with funds provided; by the Alice Pratt Brown Museum Fund
Museum purchase with funds provided; by the Stella H. and Arch S. Rowan Foundation
Museum purchase with funds provided; by the Alice Pratt Brown Museum Fund
Museum purchase with funds provided; by J. Brian and Varina Eby, by exchange
Museum purchase with funds provided by the Museum Collectors
Gift of Caroline Wiess Law
The Bayou Bend Collection, gift of Miss Ima Hogg
Gift of Anaruth and Aron S. Gordon
The Bayou Bend Collection; Gift of Miss Ima Hogg
Gift of the family of Joseph S. Cullinan, and Mr. and Mrs. David R. Wintermann, by exchange, with additional gifts from Mr. and Mrs. Harry C. Wiess; Mrs. E. L. Perry; Mr. and Mrs. John H. Blaffer in memory of his father, Robert Lee Blaffer; Edith A. and Percy S. Straus; Grand Central Art Galleries; Miss Ima Hogg; General and Mrs. Maurice Hirsch; the Allied Arts Association; Mr. and Mrs. Charles L. Bybee; Nan Greacen Faure; Helen M. Turner; Mr. and Mrs. Herbert Levine; the Axson Club, Houston; William Best; Sarah Campbell Blaffer; Mrs. Willimina Borland; Mrs. Evan W. Burris; the Houston Art League through the bequest of George M. Dickson; Miss Katherine S. Dreier; George Wharton Edwards; Parker Edwards; Mrs. William Stamps Farish; the Houston Friends of Art; Angela MacDonnell; Mrs. Justine Franklin McGuire; the Smithsonian Institution; Harmand Teplow; the University Club of Houston; Robert C. Vose, in memory of Seth M. Vose; Nelson Waggener; Emile Walters; and Irene Weir, all by exchange
Gift of Duke Energy
Gift of Vinson & Elkins L.L.P. in honor of the firm's 75th anniversary
Museum purchase with funds provided by the; Brown Foundation Accessions Endowment Fund
Museum purchase with funds provided by  One Great Night in November, 1989 
The Hogg Brothers Collection, gift of Miss Ima Hogg
Gift of Nina and Michael Zilkha in honor of Fayez Sarofim on the occasion of their tenth wedding anniversary
The Bayou Bend Collection; Gift of Miss Ima Hogg
Museum purchase, by exchange
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection; Gift of the Houston Junior Woman's Club in honor; of their forty years of service to Bayou Bend
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection,; Gift of the Theta Charity Antiques Show
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection; Museum purchase with funds provided; by the Agnes Cullen Arnold Endowment Fund
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection; Gift of Miss Ima Hogg
Museum purchase with funds provided by the; Caroline Wiess Law Accessions Endowment Fund
The Bayou Bend Collection; Gift of Miss Ima Hogg
Museum purchase with funds provided by the Museum Collectors
The Leatrice S. and Melvin B. Eagle Collection; Gift of Leatrice and Melvin Eagle
Museum purchase with funds provided by the; Mary Kathryn Lynch Kurtz Charitable Lead Trust
Gift of the Bill and Sara Morgan Family Foundation; of the Greater Houston Community Foundation
Gift of  One Great Night in November, 1987 
Museum purchase with funds provided; by Dr. and Mrs. John R. Kelsey, Jr.
Gift of Ehrich Newhouse Gallery, New York
Museum purchase with funds provided by the Hogg Brothers Collection, gift of Miss Ima Hogg, by exchange
Gift of the Karen and Eric Pulaski Philanthropic Fund of the Houston Jewish Community Foundation
Gift of Mr. and Mrs. Meredith Long
The Target Collection of American Photography; Gift of Target Stores
Gift of Nina and Michael Zilkha
Museum purchase with additional funds; provided by the National Endowment for the Arts
Gift of Frank J. Hevrdejs
Museum purchase
Gift of Frank Ribelin
Gift of the Frank Freed Memorial Painting Fund
Museum purchase
Gift of Duke Energy
Gift of Nona and Richard Barrett, Bettie Cartwright and Colin Kennedy, Isabel B. Wilson, The Brown Foundation, Inc., Melissa and Albert Joseph Grobmyer IV, Puffer-Sweiven, L.P., Carol Ballard, Janet and Paul Hobby, David Durham, and Edwin A. Eubanks
Bequest of Caroline Wiess Law
Gift of Isabel B. and Wallace S. Wilson
Gift of Duke Energy
Gift of D. and J. de Menil
Gift of Joan Morgenstern in honor of Clinton T. Willour
The Bayou Bend Collection; Gift of Miss Ima Hogg;
Gift of Roy M. Huffington, Inc., and anonymous donors
Gift of the Caroline Wiess Law Foundation
Museum purchase
Museum purchase with funds provided by the; Caroline Wiess Law Accessions Endowment Fund
Gift of D. and J. de Menil
Museum commission with funds provided by the National Endowment for the Arts and matched by The Brown Foundation, Inc
Gift of the Caroline Wiess Law Foundation
Museum purchase with funds provided by the; Caroline Wiess Law Accessions Endowment Fund
Museum purchase
The Bayou Bend Collection; Gift of Miss Ima Hogg
The Bayou Bend Collection; Gift of Miss Ima Hogg
Museum purchase with funds provided by the Agnes Cullen Arnold Endowment Fund
Museum purchase with funds provided; by the Alice Pratt Brown Museum Fund
The Hogg Brothers Collection, gift of Miss Ima Hogg
Gift of the Ranger Fund, National Academy of Design
The Bayou Bend Collection; Gift of Miss Ima Hogg
Gift of the Susan Vaughan Foundation; in memory of Susan Clayton McAshan
Museum purchase with funds provided by the Brown Foundation Accessions Endowment Fund
Museum purchase with funds provided by the Agnes Cullen Arnold Endowment Fund
Gift of AT&T New Art New Visions and the Wilder Foundation
Gift of the Charles Engelhard Foundation in honor of Linda L. Cathcart, Director of the Contemporary Arts Museum from 1979 to 1987
Gift of the Barrett Collection, Dallas, Texas
Museum purchase with funds provided by the; Caroline Wiess Law Accessions Endowment Fund
Gift of the Barrett Collection, Dallas, Texas
Gift of The Brown Foundation, Inc.
Gift of Duke Energy
Gift of The Friends of Jim Love in honor of Isabel B. Wilson
Gift of Mr. and Mrs. Meredith Long
Museum purchase with funds provided by the Caroline Wiess Law Accessions Endowment Fund
Museum purchase with funds provided by the Caroline Wiess Law Accessions Endowment Fund
Museum purchase with funds provided by the; Caroline Wiess Law Accessions Endowment Fund
Museum purchase with funds provided by the Caroline Wiess Law Accessions Endowment Fund and gift of an anonymous donor
Gift of the estate of Caroline Wiess Law
Gift of the Kevin and Lesley Lilly Family
Museum purchase with funds provided by the Brown Foundation Accessions Endowment Fund in memory of Alice Pratt Brown
Museum purchase with funds provided by the Long Endowment for American Art and the Sarah Campbell Blaffer Foundation
Museum purchase with funds provided by the Brown Foundation Accessions Endowment Fund
Gift of Mr. and Mrs. B. W. Crain in honor of E. L. Crain, M.D.
Gift of the Caroline Wiess Law Foundation, with additional funds provided by the African American Art Advisory Association and Exxon Mobil
Gift of D. and J. de Menil
Gift of the Morgan Foundation
Gift of Mr. and Mrs. W. D. Hawkins
Gift of Mr. and Mrs. John W. Mecom, Jr., by exchange
Museum purchase with funds providedby; the Agnes Cullen Arnold Endowment Fund
Museum purchase with funds provided by the; Alice Pratt Brown Museum Fund, and gifts of; Isabel B. Wilson and The Brown Foundation, Inc.
Museum purchase
Museum purchase with funds provided by; the Agnes Cullen Arnold Endowment Fund
Gift of Mrs. James W. Glanville
The Bayou Bend Collection; Gift of Alice C. Simkins in memory of Alice Nicholson Hanszen
Museum purchase with funds provided by the; Caroline Wiess Law Accessions Endowment Fund
Gift of American Decorative Art 1900 Foundation in honor of Dominique and John de Menil
Gift of Garth Clark and Mark Del Vecchio
Gift of Garth Clark and Mark Del Vecchio
Gift of John S. Arnoldy, Philip J. John, Jr., John P. Kotts, S. Reed Morian, and Bill Porter at  One Great Night in November, 2008 
Gift of Garth Clark and Mark Del Vecchio
Museum purchase with funds provided by the; 2007 Latin American Experience Gala and Auction
Gift of Cecily E. Horton in honor of the; twenty-fifth anniversary of the Core Program
Gift of Chris Urbanczyk, with matching funds provided by Chevron, with additional gifts from George and Mary Hawkins; Jane Millett Jackson; Marc and Kathleen B\xe9\xefque; Leslie and Jack S. Blanton, Jr.; Karol Kreymer and Robert Card, M.D.; Lester Marks; Russell and Diana Hawkins; Drs. Jeffrey and Linda Jackson; Karen, Gene, and Katherine Oshman; Dan Tidwell and Jamie Mize; an anonymous donor in honor of Scott and Judy Nyquist; and friends of the artists
Museum purchase with funds provided by; the African American Art Advisory Association
Gift of Isabel B. Wilson in memory of her mother, Alice Pratt Brown
Gift of Bettie Cartwright and Colin Kennedy, Martin B. McNamara, John Wilcox, Scott D. Guffey, and George Morton and Karol Howard
Gift of the John R. Eckel, Jr. Foundation
The Hogg Brothers Collection, gift of Miss Ima Hogg
The Hogg Brothers Collection, gift of Miss Ima Hogg
Wintermann Collection of American Art; Gift of Mr. and Mrs. David R. Wintermann
The Hogg Brothers Collection, gift of Miss Ima Hogg
Wintermann Collection of American Art; Gift of Mr. and Mrs. David R. Wintermann
The Hogg Brothers Collection, gift of Miss Ima Hogg
Wintermann Collection of American Art; Gift of Mr. and Mrs. David R. Wintermann
Wintermann Collection of American Art; Gift of Mr. and Mrs. David R. Wintermann
The Hogg Brothers Collection, gift of Miss Ima Hogg
The Hogg Brothers Collection, gift of Miss Ima Hogg
The Allan Chasanoff Photographic Collection
The Target Collection of American Photography, gift of Target Stores
The Allan Chasanoff Photographic Colleciton
The Target Collection of American Photography, gift of Target Stores
The Allan Chasanoff Photographic Collection
Museum purchase
Gift of the John R. Eckel, Jr. Foundation
Museum purchase with funds provided; by the Alice Pratt Brown Museum Fund
Museum purchase
Gift of Mr. and Mrs. Ralph O'Connor; in honor of Mr. and Mrs. George R. Brown
The Allan Chasanoff Photographic Collection
Garth Clark and Mark Del Vecchio Collection; Gift of the Morgan Foundation