Monterey Peninsula Museum of Art, Artists of the Monterey Peninsula Museum of Art 1875 - 1925, 1981
Aftershock! Voices from the 1906 Earthquake and Fire. Great Hall, April 1 - August 13, 2006.   California Historical Society, 1969
The Art of Fred Martin, The Oakland Museum of California, August 2003
Ray Strong: Taking in the Landscape - Santa Barbara Museum of Natural History, 2005
Oakland Museum History Gallery, Fall 1974 - June 1984; A Walk Along the Water, Oct. 5, 1996-Jan 5, 1997; Scene in Oakland, March 9-Aug. 25, 2002
San Mateo Co. Arts Council, 1977
Crocker Gallery.  CC Nahl:  Artist of the Gold Rush.  1976-1977. 25 Years of Collecting California 9 25 94 - 1 8 95 (TOM)
TOM.  Thomas Hill:  The Grand View.  1981.
The Brooklyn Museum,N.Y., Albert Bierstadt Spring, 1991.
Hearst Art Gallery, St. Mary's College.  Moraga, Ca.  William Keith:  The Early Years.  1982. Fresno Arts Ctr.  Fresno, Ca.  Views of Yosemite.  1982.  Catalog Fresno Arts Ctr.  Fresno, Ca.  William Keith - A Changing Vision of California Landscape.  1984
TOM, Kahn Collection, 1974. TOM, Great Hall, Tropical: Tropical Scenes by the 19th Century Painters of California, Oct. 5 - Nov. 14, 1971; Santa Barbara Museum of Art, Dec. 7, 1971 - Jan. 23, 1972; E. B. Crocker Art Gallery, Sacramento, Feb. 19 - Marc
M.H. de Young.  Albert Bierstadt:An Observer of Air, Light, and a Feeling of a Place.  1985.     Gene Autry Museum, L.A., CA. Native Americans: 5 Centuries of Changing Images, 11 15 89 - 3 16 90.    Autry Museum of Western Heritage, Los Angeles, Western W
CHS.  One Hundred Years of the Palace. 1975.   Gold Fever! The Lure and Legacy of the California Gold Rush  Jan 24, 1998 - Oct. 31, 1999.  Stanford Museum  3 1 1999 -5 31 2000
TOM.  Wm. Hahn Genre Painter 1829-1887.  1976.
Fresno Arts Ctr.  Views of Yosemite.  1982.
Kaiser Ctr. 1973.
Maxwell Galleries, S.F., CA ret: MAY 30, 1991
Gallery of California Art, The Oakland Museum of California    Cal. Historical Soc.  Theodore Wores:  California Impressionist Painter.  1985. Dennis Calabi, Conserv., 1990.
TOM.  William Hahn Genre Painter 1829-1887.  1976.
TOM.  William Hahn Genre Painter 1829-1887.  1976. San Mateo County Arts Council.  1977. CSU, Bakersfield.  Ca.  1979. Milwaukee Art Ctr.  Center Ring:  The Artist (An Exhibition of Two Centeries of Circus Art).  1981. The Hudson River Museum.  Domestic B
Whitney Museum.  Our American Frontier:  Images and Myths.  1973. TOM.  William Hahn, Genre Painter.  1976.  Twenty-Five Years of Collecting California. September 25,1994- January 8, 1995 (TOM).  The Edge - Oakland Museum of California, June 2 - October
U.S.C., Los Angeles.  Reality and Deception.  1974-75. California State College, Bakersfield.  1979. Philbrook Art Center. Oklahoma, Ne.  Painters of the Humble Truth.  1981-82. The Edith c. Blum Art Institute, Bard College, Food Art USA, Sep 4 - Nov 25,
Stanford University.  Landscape exhibition.  1975.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.
San Diego Museum of Art.  The Golden Land.  1986.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.  Twenty-Five Years of Collecting California. September 25,1994- January 8, 1995 (TOM)
Gold Fever! The Lure and Legacy of the California Gold Rush.  Jan 24, 1998 - Oct. 31, 1999 Palm Springs Desert Museum.  Western Drawings and Paintings.  Mar 7 - June 8, 1986.                                  Art Programs Inc. Early California exhibit, Apr
TOM. Director's Ofc. 1982.
AOL75, Vance Jordan Fine Art Inc.: Quiet Magic: The Still Life Paintings of Emil Carlsen  Oct 28 - Dec. 10, 1999   Crocker Art Museum: Bountiful Harvest - 19th Century Still Life Painting (Nov 15, 1991 - Jun 15, 1992).
15TOM.  Hist. Dept. Ca.  Grafton Tyler Brown exhibition.  1972. TOM.  Spec. Exhib. and Ed. Dept.  Ca.  Blacks in the Westward Movement. 1975. MET.  N.Y.C.  Selections of 19th Century Afro-American Art.  1976. USC Art Galleries.  L.A.  Pack-In Painters of
TransAmerican Corp.  1974. Cal. State College, Bakersfield.  1979.
Gold Fever! The Lure and Legacy of the California Gold Rush.  Jan 24, 1998 - Oct. 31, 1999 Mark Hopkins Institute of Art, S.F.  Loan Exhibition.  1900. Golden Gate International Exposition, Wells Fargo exhibit in S.F. Bldg., S.F.  1939-40. Amon Carter Mus
Mayor Lionel Wilson of Oakland on the occasion of President Jimmy Carter's stay at his house. 1980. San Diego Museum of Art.  The Golden Land.  1986.
Perspectives Gallery: Looking Back, Early San Francisco Chinatown. SFMMA.  Henry Alexander.  1940.
National Museum of Amer. Art, The Promised Land: Images of Westward Expansion, 1820-1910. Mar 15, 1991 - June 16, 1991.
Yosemite Park and Curry Co., 1962 Transamerica Pyramid, 1974 Lowe Museum - Univ of Miami, 19th C. American Topographic Painters, 1975 Fresno Arts Center, Survey of American Painting, 1977 Art Programs, S. F.  A Sense of Place - California Landscape Painti
TOM.  Impressionism:  The California View, 1890-1930.  1981. TOM.  Mathews Exhibition.  1985.
Steven Harris.  Piedmont, Ca. 1972.
California Historical Society - S.F., Raymond Dabb Yelland Exhibition, 1964 WAAM Traveling Exhibition, Small Paintings: 19th Century California Landscape, 1972 - 1973 Art Programs, S.F.  A Sense of Place - California Landscape Painting 1870-1930.  1978. C
Grace Hudson: a California Romantic, Grace Hudson Museum, Ukiah, 9 24 1996-3 10 1997
LACMA: Made in California, 2000. SFAA, Loan Collection from Irving M. Scott and Charles Crocker.  1891.     Fine Arts Bldg. N.Y.C.  Inness Memorial Exhibition.  1894.    Fifth Avenue Art Galleries. N.Y.C.  Inness Executor's Sale.  1895.    TOM.  George In
Perspectives Gallery: Looking Back, Early San Francisco Chinatown. TOM.  Black Perspective.  1989.
TOM.  Mathews Exhibition.  1972. SFMMA.  The Modern Era...  1976. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985.                                                Eli Wilner Gallery, NYC.  exh. of frames.  1988.                        Eli Wilner Gallery, NYC.  exh. of frames. (this time at the Met in NYC) 1990.  The Parrish Art Museum, Dec 22, 1990 - Feb 3, 1991.  WHERE: Telfair Academy of Arts & Sciences,  1993.
TOM.  Mathews Exhibition.  1972. (Cat.) TOM.  Mathews Exhibition.  1985.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
TOM.  Mathews Exhibition.  1972. (Cat.) TOM.  Mathews Exhibition.  1985.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
College of Notre Dame, 1979.  TOM, 25 Years of Collecting California, 9 25 94 - 1 8 95.  TOM, Perspectives Gallery, Canine Companions,  August 30 - Oct. 31, 1999.
Clorox Co.  1976. WAAM.  1978.
TOM, Martinez Exhib, 1974. TOM, California Artists: A Group Portrait in Mixed Media, 1987-1988.
TOM.  Mathews Exhibition.  1972.  (Cat.) WMAA.  N.Y.  1978. TOM.  Mathews Exhibition.  1985.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95; Museo ItaloAmericano, Gottardo Piazzoni: Painter of the California Landscape, 1872 - 1945 June 8, 2000 - September, 2000
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985.
Aftershock! Voices from the 1906 Earthquake and Fire. Great Hall, April 1 - August 13, 2006.   LACMA: Made in California, 2000. PPIE. TOM.  Mathews Exhibition.  1972.  (Cat.) Triton Museum.  Santa Clara, Ca.  The Seat of American Invention.  1977. Brooklyn Museum.  N.Y.  The American Renaissance.  1979. TOM.  Mathews Exhibition.  1985. Eli Wilner Gallery, NYC.  exh. of frames.  1988. The Parrish Art Museum, Dec 22, 1990 - Feb 3, 1991. Eli Wilner Gallery, NYC.  exh. of frames.  (this time at the Met in NYC).  1990.    Facing Eden: One Hundred Years of Landscape Art in the San Francisco Bay Area, M.H. de Young Memorial Museum 6 24 95- 11 26 95
Oakland to the Rescue! April 1, History Spotlight Gallery 2006 - December 2, 2007.
Panama-Pacific International Exposition.  S.F., Ca.  1915. TOM.  Mathews Exhibition.  1972.  (Cat.) SFMMA.  1976. NCFA.  1976. TOM.  Mathews Exhibition.  1985.
M. Knoedler & Co.  N.Y.C.  William Merritt Chase (1849-1916): A Benefit Exhibtion for the Parrish Art Museum.  1976. TOM.  Impressionism, The California View.  1981.   Georgia Museum of Art, University of Georgia: California Impressionists (travelling
The Crocker Art Museum, American Impressionist Paintings from West Coast Collections August 1, 1999 - October 31, 1999.  Pasadena Museum of California Art, On-Ramps: Transitional Moments in California Art, June 1- Sept. 1, 2002.
TOM.  Impressionism:  The California View.  1981.                                                             TOM.  Impressionism:  The California View.  1981, Laguna Beach Museum of Art, 1 15 82 to 2 21 82.                      TOM.  Impressionism:  The
University of Southern California, School of Fine Arts: Macdonald-Wright, 1985.
TOM.  Mathews Exhib.  1972.  Catalog #33.  Triton Museum.  Two Artists Look at California.  1976. WAAM.  Our Environment.  1980-82. TOM.  Mathews Exhibition.  1985. San Diego Museum of Art.  The Golden Land.  1986.  M.H. deYoung Museum, Facing Eden:100 Ye
Henry Art Gallery, Univ. of Wash., Seattle.  American Impressionism.  1980 (t). TOM.  Impressionism: The California View, 1890-1930.  1981-82 (t). Whitney Museum of American Art.  Reflections of Nature:  Flowers in American Art.  1984.
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.
Fine Arts Museum of San Francisco.  Cityscape Exhibition.  1977. M. H. de Young Museum.  1977.
Panama Pacific International Exposition, titled The Carnation, 1915.  TOM, Mathews Exhibition, 1972.  (Cat.) TOM, Mathews Exhibition, 1985. Eli Wilner & Co Metro. Museum of N.Y., July 15 - Sept 9, 1990 (see inhouse note). Greenville County Museum of Art, Regional American Painting to 1920,  Nov 6 - Dec 30, 1990.  OMCA, Great Hall, California as Muse: The Art of Arthur and Lucia Mathews 10 28 2006 - 03 25 2007; traveling to Norton Museum of Art and Akron Art Museum; Fall 2007 - Fall 2008.
Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
TOM.  Impressionism, The California View.  1981. Monterey Peninsula Museum of Art, The Works of Euphemia Charlton Fortune, Sept 23, 1989 - Jan 7, 1990.  M.H. de Young Memorial Museum, Viewpoints XV: A Time of Change - Northern California Women Artists, 18
The Great O'Shea November 6-December 24, 1986, Civic Arts Gallery, Walnut Creek, CA. John O'Shea Retrospective,  January 17-March 2, 1986, Monterey Peninsula Museum of Art.
TOM.  Mathews Exhibition.  1985.
Pasadena Art Museum.  California Design-1910.  1974. WAAM.  California Landscape.  1978-80. Walnut Creek Civic Arts Gallery.  Rolling Hills and Purple Cows.  1982. Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95   F
TOM.  California Artists:  A Group Portrait in Mixed Media.  1987-1988. de Young.  CA Colorists:  Ptgs. of the Society of Six.  1989.
TOM.  Ca.  Society of Six.  1972. SFMMA.  Ca.  Painting and Sculpture in California:  The Modern Era.  1976. Flint Inst. of Arts. Mi.  Art of the Twenties.  1978. TOM.  10 x 10.  1979. de Young.  CA Colorists:  Ptgs. of the Society of Six.  1989.   Crocke
LACMA: Made in California, 2000. TOM.  Society of Six.  1972. SFMMA.  Painting & Sculpture in California:  The Modern Era.  1977. Piedmont Art in the Park Festival.  1973. de Young.  CA Colorists:  Ptgs. of the Society of Six.  1989.
Foremost McKesson Inc, S F, 1975      San Mateo Co. Arts Council, 1977 WAAM Tour, 1978
Piedmont, Ca.  Art in the Park Festival.  1973. TOM.  Impressionism: The California View. 1981. Catalogue.                                                      TOM.  Impressionism: The California View, Laguna Beach Museum of Art, 1 15 82 to 2 21 82.                                 Tom.  Impressionism: The California View, Crocker Art Museum, 3 28 82 to 5 2 82.
Choices! Recent Acquisitions (TOM-Art Special Gallery) 11 94 - 8 95
TOM.  Society of Six.  1972. SFMMA.  Painting and Sculpture in California:  The Modern Era.  1976-77. TOM.  Impressionism, The California View.  1981-82. Walnut Creek Civic Arts Gallery. Walnut Creek, Ca.  Rolling Hills and Purple Cows.  1982. de Young.
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985. TOM.  Small Landscapes (perspectives show)  1988.
TOM.  Mathews Exhibition.  1972.  (Cat.) Foremost-McKesson.  S.F., Ca.  1975. Chamber of Commerce.  Oakland, Ca.  1977. WAAM.  N.Y.  California Landscapes.  1978. Crocker Art Museum.  Sacramento, Ca.  From Exposition to Exposition.  1981. TOM.  Mathews Exhibition.  1985. San Diego Museum of Art.  The Golden Land.  1986.
Carnegie Institute. Pittsburgh, Pa.  30th Annual International Exhibition of Painting.  1931 CPLH.  S.F.  Lucien Labaudt.  1933 SFMMA.  Lucien Labaudt (Memorial Exhibition).  1944. Rotunda Galleries of City of Paris. S.F.  1945.    The Fabric of Life:150
GGIE.  1939. CPHL.  SFAA 54th Annual Exhibition.  1932. Ilsley Galleries, L.A.  1933. LA. Art Association.  All California Art Exhibit.  1934.   M.H.deY.  1968. Phoenix Art Museum. Phoeniz, Az.  1970. California Academy of Sciences, SF. 1981. The American
California State Fair, Sacramento.  1933. MOMA.  New York.  Painting and Sculpture from 16 American Cities.  1933 Golden Gate Intl. Exposition, Dept. of Fine Arts.  S.F.  Contemporary Art.  1939.
Civic Arts Gallery, Walnut Creek, 1973 See's, 1977 TOM, Watercolors from the California Collection, 1977 Art Programs Inc., 1980  Palo Alto Cultural Center  1993  1994     California State University, Chico: 3 10 - 4 9 1994.   A Half-Century of Hope and S
TOM.  Mathews Exhibition.  1972.  (Cat.) I. Magnin.  1976. Athenian Nile Club.  1980. White House, Washington, DC.  1981. TOM.  Mathews Exhibition.  1985. American Embassy, Canberra, Australia.  1986- Fresno Met. Museum, 1990.
The Desert Inn Galleries.  Palm Springs, Ca.  1938, 40. Golden Gate Intl. Exposition, Dept. of Fine Arts.  S.F.  1939. Riverside Art Association Gallery.  Ca.  1941. SFMA.  1943. SBMA.  1943. SFMMA.  Painting and Sculpture in California:  The Modern Era.
We Called it a Work Holiday: The 1946 Oakland General Strike, Oakland Museum of California, History Dept. 11 22 96 - 2 23 97
A Time and a Place, TOM and 3 traveling venues, 1990-92; SFMMA (San Francisco Museum of Art) 1935
Santa Barbara Museum of Art.  Turning the Tide.  1990-1992.   Pacific Dreams: Currents of Surrealism and Fantasy in California Art, 1934-1957 (TOM) 2 25-6 11 95, UCLA at the Armand Hammer Museum of Art and Cultural Center 7 11-9 17 95, Nora Eccles Harriso
Golden Gate Exposition, 1939    Crocker Art Museum - Sacramento, From Exposition to Exposition - Progressive and Conservative Northern California Painting. 1915-1939, 1981.    Jan Holloway Gallery - Berkeley Art Scene 10 21-11 29 93.    California State U
Several labels on the back of the painting indicate it was in exhibitions at the Laguna Art Museum, The Irvine Museum, and the Corcoran in Washington D.C.
TOM.  Artists of California.  1987-88.
SFMA.  61st Annual Exh. of Painting & Sculpture of SFAA.  1941. TOM.  Mine Okubo:  An American Experience.  1972.   (later travelled under auspices of WAAM, 1974-1975)     The Japan Society of Boston, Inc. Mar 10 - Apr 23, 1993.
La Jolla Museum of Contemporary Art.  Helen Lundeberg:  A Retrospective Exhibition.  1971. SFMMA.  Lorser Feitelson and Helen Lundeberg:  A Retrospective Exhibition.  1980-81. LACMA.  A Tribute to Helen Lundeberg.  1988. Santa Barbara Museum of Art.  Turn
TOM, Cat and a Ball on a Waterfall:  200 Years of California Folk Painting and Sculpture, 1986.TOM (PERS), Folk Painting,1989.
TOM.  A Period of Exploration: San Francisco 1945-1950.  1973. College of Note Dame, Early and Recent Abstract Expressionist Paintings, Feb 17 - Mar 27, 1988.  Monterey Peninsula Museum of Art.  Early and Recent Abstract Expressionists Paintings.  Mar -
SFMMA.  On Looking Back.  1968.
UC, Davis, Ca.  Innovations in Bay Area Painting.  1983.
TOM.  A Period of Exploration on Exhibition, 1973 Boise Gallery of Art, Abstract Expression, 1976 TOM, Art in the San Francisco Bay Area: 1945-1980, 1985. College of Notre Dame, Early and Recent Abstract Expressionist Paintings, Feb 17 - Mar 27, 1988. M
TOM.  Art in the San Francisco Bay Area:  1945-1980.  1985. TOM.  California Artists:  A Group Portrait in Mixed Media.  1987-1988.
Hackett Mill, LLC (Gallery - San Francisco) - 1 7 2011 - 4 1 2011.
Albright-Knox.  Retrospective.  1976-77. Hara Museum, Tokyo.  RD:  Ptgs. & Works on Paper.  1989.                                                        SFMOMA, RETROSPECTIVE, Nov 19,1992 - Jan 24, 1993.
Richmond Art Center, CA. Edward Corbett Retrospective.  Sep 1990 - Jan 1991.
Washington Gallery of Modern Art.  Diebenkorn Retrospective.  1964. American Federation of the Arts.  7th International Art Exhibition, Mainichi, Tokyo.  1963.                            Whitechapel, London - Diebenkorn Retrospective, Jan 10 - Mar 8, 1992
Mills College Studio Art Faculty Retrospective Exhibition, Sep 25 - Dec 14, 1986.TOM, Twenty-Five Years of Collecting California, September 25, 1994 - January 8, 1995.
Wally Hedrick: Selected Works, San Francisco Art Institute, 4 10-5 11 85   SFAI at 125, 2 28 96 - 8 1 96, Perspectives Gallery, OM
Univ. Art Gallery, U.C. Berkeley, Ca.  David Park Memorial Exhibition: The University Years 1955-60 (t).  1964. SBMA, Ca.  David Park: His World.  1968. Maxwell Galleries Ltd., S.F.  David Park.  1970. Newport Harbor Art Museum, Newport Beach, Ca.  David
TOM.  Recent Acquisitions.  1985.
Albright Knox Gallery. 1976. On loan to Vice President Mondale.  1980. SFMMA.  Resource Reservoir.  1983. Grey Art Gallery, NY.  The Figurative Mode:  Northern California Painting 1955-1965.  1984 Seattle World's Fair.  American Art Since 1950.  1962. Cui
SFMMA.  1966. Phoenix Art Museum, Az.  Wayne Thiebaud Retrospective.  1976-77. TOM.  10 x 10.  1979. Vice President Mondale's home.  Washington, D. C.  1980. Walnut Creek Civic Arts Gallery.  Ca.  Realism.  1980. NCFA.  Washington, D. C.  Art for The Vice
Hara Museum, Tokyo.  RD:  Ptgs. & Works on Paper.  1989.
TOM.  The Dilexi Years:  1958-1970.  1984.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
Galerie D. Benador. Geneva, Switzerland.  1964. Pasadena Art Museum, California.Frank Lobdell.  1966 (t). Boise Gallery of Art, Idaho.  Abstract Expressionism.  1976.
SFMMA.  Bay Area Figurative:  1950-65.  Dec 1989 - 1990 (travelling).                                             Wiegand Art Gallery, College of Notre Dame, Belmont, CA., Apr 2 - May 9, 1992
UAM, U.C. Berkeley, Ca.  Joan Brown.  1974. De Saisset Museum, Univ. of Santa Clara.  Northern California Art of the Sixties.  1982. Grey Art Gallery, NY.  The Figurative Mode:  Northern California Painting 1955-1965.  1984. TOM.  Art in the San Francisco
TOM.  Nathan Oliveira: Paintings, 1959-1973.  1973. Cheney Cowles Memorial Museum. Spokane, Wa.  1978. SFMMA.  Nathan Oliveira Retrospective.  SEPT 1984-AUG 1, 1985.SFMMA.  BAY AREA FIGURATIVE: 1950-65, DEC 14, 1989 THRU 1990 (TRAVELING). Saint Mary
Hara Museum, Tokyo.  RD:  Ptgs & Works on Paper.  1989.  Cal State LA  
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
Art in Embassies Program.  Sweden.  1979-81.
LACMA: Made in California, 2000.  Wiegand Gallery, College of Notre Dame, Wonner Brown exhibition, October 19 - December 11, 1999
San Francisco Art Institute 82nd Annual Exhibition, 1963
Kent Fine Arts, NYC.  Llyn Foulkes.  1987   Palm Springs Desert Museum, Dec 1, 1991 - Feb 1, 1993. (Catalogue travel).   Lynn Foulkes: Between a Rock and a Hard Place  October 27, 1995 - January 21, 1996 Laguna Art Museum (tour, including OMCA  11 23 96 -
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
CPLH.  Painters Behind Painters.  1967. TOM.  Sam Tchakalian Paintings. 1978. Portland Ctr. for the Visual Arts. Sam Tchakalian Paintings.  1979. Kaiser Ctr. 1980. SFAI. Sam Tchakalian. 1982. de Saisset Art Gallery. Santa Clara, Ca. Northern Berkeley Art
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
OMCA, Robert Bechtle: California Classic, May 1-Sept. 30, 2000.SFMOMA, Robert Bechtle: A Retrospective, February 12, 2005 - August 28, 2005 (includes venues)OMCA, Great Hall, CCA:  100 Years in the Making, Oct. 13, 2007 - March 16, 2008
TOM.  10 x 10.  1979. San Jose Museum of Art.  Art for Arts Sake.  Jul 10- Sep, 1987.
TOM, Mine Okubo: An American Experience, 1972.
SFMOMA: Robert Bechtle: A Retrospective, February 12 2005 - August 28, 2005 (includes venues)
Geoffrey Bowman, 1963 - 1998: A Retrospective Selection Frederick Spratt Gallery in association with Evans Willis Gallery, San Francisco, CA December 14, 1998 - January 19, 1999
Albright-Knox Art Gallery, 1976.  SFMMA, Edward Ruscha, 1982. Sheldon Memorial Art Gallery, University of Nebraska, 1990. Gagosian Gallery, N.Y., Jan - Feb, 1993.Centre  Georges Pompidou, L'informe: Modernism Against the Grain, from May 15 - A
TOM. 10 x 10.  1979. Vice President Mondale's Home.  1980.  San Jose Museum of Art, For Arts Sake, Jul 10 - Sep, 1987.
OMCA, Gallery of California Art, A Legacy of Art: The Ted and Ruth Nash Collection, August 24 - December 30, 2007.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
de Young Museum, The Measure of all Things: Paintings by Irving Norman, July 3 - October 20, 1996.  (L96.75.07.01)OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
Walnut Creek Civic Art Gallery, The Planar Dimension, Geometric Abstraction in Bay Area Art, 1983.
TOM.  Gordon Onslow-Ford: Retrospective Exhibition.  1977.
City of Walnut Creek.  Realism.  1980. CCAC.  Alumni Show.  1981.
A Legacy of Art: The Ted and Ruth Nash Collection, OMCA, August 24 - December 30, 2007
California Art in the Age of Pluralism: 1974 - 1981, Museum of Contemporary Art Los Angeles, October 2, 2011 - January 30, 2012Razor Gallery, N.Y.C., Robert Colescott: Paintings, 1977. TOM, Black Perspective, 1989.The Museum of Contemporary Art,
TOM.  10 x 10.  1979. Whitney Museum.  1981 Biennial Exhib.  1981. The Museum of Contemporary Art  DEC 10, 1986 - JAN 10, 1988.    Whitechapel, London - Diebenkorn Retrospective, Jan 10 - Mar 8, 1992.    Richard Diebenkorn  Whitney Museum of American Art,
TOM.  From the Sunny Side:  Six East Bay Artists.  1982. TOM.  Black Perspective.  1989.
A Legacy of Art: The Ted and Ruth Nash Collection, OMCA, August 24 - December 30, 2007
Fuller-Goldeen Gallery, S.F.  Artists from 50 States.  1984.
Gallery Paule Anglim
A Legacy of Art: The Ted and Ruth Nash Collection, OMCA, August 24 - December 30, 2007
Exhibited in California Cityscapes at the San Diego Museum of Art in 1991
Scene in Oakland, Oakland Museum of California Art Department, March 9- August 25, 2002., Art Special Gallery
OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
1. 1993 Roseville Arts Center; 2. 1993 Judith Weintraub Gallery
25 Years of Collecting California 9 25 94 - 1 8 95 (TOM)
TOM, Raymond Saunders: New Work, 1994.OMCA, Great Hall, Artists of Invention: A Century of CCA, Oct. 13, 2007 - March 16, 2008.
Oakland Museum of California, Squeak Carnwath: Painting Is No Ordinary Object, April 25 to August 23, 2009, Great Hall High Bay (EX42).
Squeak Carnwath: Painting Is No Ordinary Object, OMCA, Great Hall High Bay,  April 25 - August 23, 2009.
Rena Bransten Gallery, 1999
Braunstein-Quay Gallery
Hackett Freedman Gallery, date unknown (between 2000 - 2001)
A Legacy of Art: The Ted and Ruth Nash Collection, OMCA, August 24 - December 30, 2007
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, LA PAINT Oct 4, 2008 -  March 8, 2009, Great Hall High Bay
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
OMCA, Great Hall High Bay, LA Paint, October 4 - March 8, 2009.OMCA, Gallery of California Art, Open Space 2 3, 2000 and Rising, May 1 - Aug. 1, 2010.
Oakland Museum of California Collector's Gallery, Fred Martin: From Asia April 1-May 24, 2004
Gold Fever c. 12 97; Gold Fever! The Lure and Legacy of the California Gold Rush.  Jan 24, 1998 - Oct. 31, 1999
TOM.  Cat and a Ball on a Waterfall:200 YEARS OF CALIFORNIA FOLK Painting and Sculpture.  1986. TOM (PERS).  Folk Painting.  1989.
National Museum of American Art. 1991.
National Museum of American Art 1991;  St. Mary's College, Fascination With Trains 11 21 93-1 9 94
U.S.C. L.A. Ca.  Packing-In: Painters of the American West.  1976.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.  Twenty-Five Years of Collecting California. September 25,1994- January 8, 1995 (TOM).  California as Muse: the Art of Arthur and Lucia Mathews, OMCA, Great Hall, 10 28 2006 - 03 25 2007.
Twenty-Five Years of Collecting California. September 25,1994- January 8, 1995 (TOM)   TOM.  Mathews Exhibition.  1972. San Jose Museum of Art.  Ca.  Americans in Paris.  1975. The Detroit Institute of Arts, Detroit, MI., American Art and the Quest for Unity, 1876-1893, 1983. TOM: Mathews Exhibition, 1985.
PPIE. TOM.  Mathews Exhibition.  1972.  (Cat.).   Fresno Arts Center.  Ca.  Survey of American Painting.  1977. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985. TOM.  California Artists:  A Group Portrait in Mixed Media.  1987-1988.
TOM.  Mathews Exhibition.  1972.  (Cat.) TOM.  Mathews Exhibition.  1985. TOM.  California Artists:  A Group Portrait in Mixed Media.  1987-1988.
MOMA.  1976. Tacoma Art Museum.  1979. The American-Australian Foundation for the Arts.  Dec 1986 thru April 1987.
Tacoma Art Museum.  1979. The American-Australian Foundation for the Arts. Dec 1986 thru Apr 1987.
MOMA.  The Natural Paradise, Ptg. in Amer. 1800-1950.  1976. Tacoma Art Museum.  1979. The American-Australian Foundation for the Arts.  Dec 1986 through April 1987.Facing Eden: One Hundred Years of Landscape Art in the San Francisco Bay Area, M.H. de You
PPIE. S.F. 1915. Mills College Art Gallery.  1981-82.
PPIE.  1915.  (titled Hot Afternoon) Mills College Art Gallery. 1973. TOM.  Impressionism, The California View.  1981-82. Cummer Gallery of Art, Oct 15, 1986 through January 11, 1987, 25th  Anniversary, Curator, Dr. Gerdts.  Guy Rose, American Impressio
TOM.  Mathews Exhibition.  1972. Pasadena, Ca.  California Design:  1910.  1974. SFMMA.  California:  The Modern Era.  1976. TOM.  Mathews Exhibition.  1985.
TOM.  Society of Six.  1972. TOM.  Impressionism, The California View.  1982-82 (t). de Young.  CA Colorists:  Ptgs. of the Society of Six.  1989.                                                    Crocker Art Museum, California Modernist Painting, Nov 1
SFMMA.  Ca.  Painting and Sculpture in California:  The Modern Era.  1976. Flint Institute of the Arts.  Art of the Twenties.  1978. Crocker Art Museum. Sacramento, Ca. From Exposition to Exposition.  1981. de Young.  CA Colorists:  Ptgs. of the Society o
TOM, Cat and a Ball on a Waterfall:  200 Years of California Folk Painting and Sculpture, 1986.St. Mary's College, Fascination with Trains, Nov 21, 1993 - Jan 9, 1994.  San Francisco Craft and Folk Art Museum, Working Folk, June 3 - Aug. 6, 1995
California Palace of the Legion of Honor, 1945 (see label, verso)  Newport Harbor Art Museum, David Park Retrospective, 1977 - 1978
LACMA: Made in California, 2000. SFMMA.  California: The Modern Era.  1976. SFAI.  1969. TOM.  A Period of Exploration.  1973. SFMMA.  1976 - 1977. Newport Harbor Art Museum.  Park Retrospective.  1977-1978. New York University - Grey Art Gallery.  The Fi
Scene in Oakland, ASG (OMCA) Spring 2002
TOM, David Park Retrospective Show, 1962 Heritage Gallery, 1968 Newport Harbor Art Museum, David Park Retrospective, 1977 - 1978 TOM.  California Artists:  A Group Portrait in Mixed Media.  1987-1988. Whitney Museum of Am. Art.  David Park Retro.  1988-19
Colorado Springs Fine Arts Center, Museum Aqusitions, 1962 Newport Harbor Art Museum, David Park Retrospective, 1977 - 1978 TOM.  David Park (organized by Whitney, Oakland venue only).  1989.  Cal. State LA 1992 
OAM.  Contemporary Bay Area Figurative Painting.  1957. CPLH, S.F.  Winter Invitational.  1960. TOM.  Elmer Bischoff: Figurative Paintings, 1957-72.  1975. SFMMA.  Bay Area Figurative: 1950-65.  1989.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
MEMORY AND IMAGINATION: The Legacy of Maidu Indian Artist Frank Day - March 15 to Oct. 19, 1997, Oakland Museum of California.
Transformation:the Art of Joan Brown; Oakland Museum of California, Sept. 26, 1998-January 17, 1999
TOM.  Mel Ramos: Paintings 1959-1977.  1977. Rose Art Museum, Brandeis Univ.  Waltham, Ma.  Mel Ramos: A Twenty-Years Survey.  1980.
TOM.  One Hundred Years of California Printing from 1849.  1966.
The Trust for Museum Exhibitions. American WeWestern Art: From Myth to Reality     OMCA: The Art of the Gold Rush     WMMA.  N.Y.C.  The American Frontier: Images and Myths.  1973. NCFA, Smithsonian Inst.  Washington, D.C.  America As Art.  1976. TOM. 1
Whitney Museum of American Art.  N.Y.  The Painters America.  1974. The Hudson River Museum, Yonkers, N.Y., domestic Bliss,May 4 - July 27, 1986, see notes for tour.
The Edge - Oakland Museum of California, June 2 - October 14, 2007.
Pomona College Art Gallery.  1962. U.C. Davis.  1964. CHS.  Robinson Exhib.  1965. Fresno Arts Ctr. Survey of American Painting.  1977-78. Tampa Art Museum.  1990.
Tacoma Art Museum.  1979. The American-Australian Foundation for the Arts.  Dec 1986 through April 1987.
Lent to Mills College Art Gallery, 1973. Lent to Oakland City Hall, 1974. Lent to administration offices, 1977. Lent to Broliech, Phleger & Harrison, 1977. Lent to museum administration offices, 1981. Lent to Impressionism: The California View, 1890-
TOM.  Mathews Exhib.  1972.  Catalog #86. TOM.  Mathews Exhibition.  1985.
The Golden Gate International Exposition, 1939. TOM, Mathews: Masterpieces of the California Decorative Style, 1972. TOM, Mathews Exhibition, 1985.  OMCA, Great Hall, California as Muse: The Art of Arthur and Lucia Mathews 10 28 2006 - 03 25 2007; traveling to Norton Museum of Art and Akron Art Museum, Fall 2007 - Fall 2008.
Paintings by Henrietta Shore, The Fine Arts Society of San Diego (no.33), Los Angeles Museum of History, Science and Art, 1927 (no.16); Henreietta Shore, Georgette Passedoit Gallery, New York, 1939 (no.4);  Henrietta Shore, A Retrospective Exhibition: 190
Museo Italo Americano, SF, Ca.  Italian American Artists in California, 1875-1925.  1981.
Oakland Art Gallery, 1939 (Coit Tower)   Recent Acquisitions: California Art 1900-1935 (OM Perspective Gallery 6 23 1997 - )
GGIE, 1939; Panama-California Exposition, 1915 (Silver Medal)
Recent Acquisitions: California Art 1900-1935 (OM Perspective Gallery 6 23 1997 - )
PPIE. TOM.  Mathews Exhibition.  1972.  (Cat.) TOM.  Mathews Exhibition.  1985.
TOM, Mine Okubo: An American Experience, 1972.
U. of Washington, Coming to Life, The Figure in American Art, 1999  TOM.  Bay Area Figurative Painting Show.  1957. SFMMA.  BAY AREA FIGURATIVE: 1950-65, DEC 14, 1989 THRU 1990 (TRAVELING).
Palace of Legion of Honor. S.F., Ca.  1972.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
Oakland City Hall. 1968-1979.
TOM, Cat and a Ball on a Waterfall:200 YEARS OF CALIFORNIA FOLK Painting and Sculpture,1986. TOM (PERS), Folk Painting, 1989. Orange County Museum of Art, Gold Rush to Pop, 1998.
TOM, Mine Okubo: An American Experience, 1972.
TOM, Mine Okubo: An American Experience, 1972.
TOM, Mine Okubo: An American Experience, 1972.
TOM, Mine Okubo: An American Experience, 1972.
TOM, Mine Okubo: An American Experience, 1972.
TOM.  Charles Christian Nahl.  1976.
Art Programs, S.F.  A Sense of Place - California Landscape Painting 1870-1930.  1978.
TOM.  Impressionism:  The California View.  1982.
Stanford Univ. Museum.  Calif. Landscape.  1975.
Santa Cruz Museum.  1975. U.C. Riverside.  F. Billing, A Gentleman Artist. 1976.
California Section.  Inness Signature Year.  1978-79.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
WAAM.  Small Paintings 19th c. California Landscape.  1972-74.  Catalog #11.
San Diego Museum of Art.  The Golden Land.  1986.
Western WA Univ., Bellingham.  Halcyon Summer.  1986. (Cancellation of loan,   late notification, May 6, 1986.) San Diego Museum of Art.  The Golden Land.  1986.
Notre Dame.  Siegriest Exhib.  1976. TOM.  Impressionism:  The California View, 1890-1930.  1981-82.  (Catalogue)                                        TOM.  Impressionism:  The California View, 1890-1930, Laguna Beach Museum of Art, 1 15 82 to 2 21 82.
Dunsmuir House.  1975.
Walnut Creek Civic Arts Gallery, Rolling Hills and Purple Cows, 1982 de Young.  CA Colorists:  Ptgs. of the Society of Six.  1989.
Brobeck, Phleger & Harrison.  1977. Mayor's Office, City Hall, 1978.                                                                           Hearst Art Gallery, Maurice Logan: Artist and Designer, Jul 5 - Sep 25, 1991.
Piedmont, Ca.  Art in the Park.  1973. SFMMA.  Ca.  Painting and Sculpture in California:  The Modern Era.  1977.
Walnut Creek Civic Art Gallery.  Ca.  Rolling Hills and Purple Cows.  1982. de Young.  CA Colorists:  Ptgs. of the Society of Six.  1989.
Transamerica Corp, 1974 San Mateo Co. Arts Council, 1977    Paintings From the Past: Coastal Marin 8 8 - 9 28 1997, Bolinas Museum
TOM.  Thomas Hill:  The Grand View.  1980. Philbrook.  Tulsa, Ok.  Painters of the Humble Truth.  1981.                                                     Crocker Art Museum: Bountiful Harvest - 19th Century Still Life Paintings, (Nov 15, 1991 - Jun 15,
TOM.  Thomas Hill: The Grand View.  1980.  American Views: Oil sketches by Thomas Hill, Crocker Art Museum 1 26-3 9 97 and traveling through 12 97
Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
Piedmont, Ca. Art in the Park.  1973. Chas. Greene Library. Oakland, Ca.  1977.
SFAI.  1969. TOM.  California Section.  Inness-Signature Years.  1978.
Ponoma College Art Gallery.  1962. Steven Harris.  Piedmont, Ca.  1972. San Jose Museum of Art.  1980.
PPIE.  S.F. 1915. U.C. Davis.  1965. TOM. Martinez Retrospective.  1974. Monterey Peninsula Museum of Art. Artists of the Monterey Peninsula 1875-1925.  1981. Walnut Creek Civic Art Gallery.  1987.   CCAC: Past Present and Future 9 4 96-10 26 96
TOM.  Martinez Retrospective.  1974. Grand Central Art Galleries, NYC.  American Tonalist Painters.  1982.
Sonoma College Art Gallery.  1962. TOM.  Martinez Exhib.  1974. Art Programs, S.F.  A Sense of Place - California Landscape Painting 1870-1930.  1978. Walnut Creek Civic Arts Gallery.  Rolling Hills & Purple Cows.  1982. San Diego Museum of Art. The G
Newport Harbor Art Museum.  California Design 1910.  1974. Martinez exh.  1974.
TOM Xavier Martinez 1974.  Catalog #44.
PPIE. TOM.  Mathews Exhibition.  1972.  (Cat.) Pasadena, Ca.  California Design - 1910.  1974. WMAA.  N.Y.  Seascape and the American Imagination.  1975. New York Univ. and Univ. of Kansas.  1979. TOM.  Mathews Exhibition.  1985.
PPIE. TOM.  Mathews Exhibition.  1972.  (Cat.) New York Univ. and Univ. of Kansas.  1979. TOM.  Mathews Exhibition.  1985.
TOM.  Thomas Hill:  The Grand View.  1980. Palm Spgs. Desert Museum.  Western American Art in California Collections.  1982. Fresno Arts Center.  Views of Yosemite.  1982. New Orleans Museum of Art.  The Waters of America--19th Century American Painting.
San Jose Museum of Art.  1980.
LACMA: Made in California, 2000. Charles Campbell Gallery.  S.F.  Selden Gile Exhibition.  1976. TOM.  Impressionism, The California View.  1981-82 (t). San Diego Museum of Art. The Golden Land. 1986. de Young.  CA Colorists:  Ptgs. by the Society of Six.
25 Years of Collecting California 9 25 94 - 1 8 95 (TOM) TOM.  Recent Acquisitions.  1975. TOM.  Charles Griffin Farr:  A Retrospective.  1984. Santa Barbara Museum of Art.  1985. American Acadamy And Institute of Arts and Letters, N.Y., Jan - June, 1987.
Triton Museum of Art, March 2000     Cal. Historical Soc.  Theodore Wores:  California Impressionist Painter.  1985.
de Young.  CA Colorists:  Ptgs. by the Society of Six.  1989.
TOM.  Mathews Exhibition.  1972.  (Cat.) OMAR.  1975. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
TOM.  Mathews Exhibition.  1972.
Triton Museum.  Santa Clara, Ca.  Two Artists Look at California.  1976. TOM.  Mathews Exhibition.  1985.
PPIE. TOM.  Mathews Exhibition.  1972. SFMMA.  California:  The Modern Era.  1977. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.  Twenty-Five Years of Collecting California. September 25,1994- January 8, 1995 (TOM)
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exh.  1972. TOM.  Mathews Exhibition.  1985.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972. Triton Museum.  Santa Clara, Ca.  Two Artists Look at California.  1976. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972.  (Cat.) CSU.  Bakersfield, Ca.  1979. TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1972.  (Cat.) Pasadena, Ca.  California Design:  1910.  1974. Art Programs, Standard Oil.  S.F., Ca.  1975. Triton Museum. Santa Clara, Ca.  Two Artists Look at California.  1976. WAAM.  N.Y.  1978. Santa Cruz Historical Society.  The Craftsman Style:  From Roots to Revival.  1983. TOM.  Mathews Exhibition.  1985.
The New York Cultural Center.    TOM.  Mathews Exhibition.  1972.  (Cat.) TOM.  Mathews Exhibition.  1985.
TOM.  Mathews Exhibition.  1985.
Foremost-McKesson Inc., S.F., Ca.  1975. San Mateo County Arts Council.  Ca.  1977. TOM.  Mathews Exhibition.  1985. Eli Wilner Gallery, NYC.  exh. of frames.  1988. Eli Wilner Gallery, NYC.  exh. of frames, (Jul 15 - Sep 9, 1990).  California as Muse: The Art of Arthur and Lucia mathews OMCA, Great Hall High Bay, October 28, 2006 - March 25, 2007,  Norton Museum of Art and Akron Art Museum; Fall 2007 - Fall 2008.
TOM.  Mathews Exhibition.  1985.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
TOM.  Mathews Exhibition.  1972. Pasadena.  California Design 1910.  1974. TOM. Mathews Exhibition.  1985. TOM.  Small Landscapes (perspectives show)  1988.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
TOM.  Mathews Exhibition.  1985.
PPIE. TOM.  Mathews Exhibition.  1972. TOM.  Mathews Exhibition.  1985.  Twilight and Reverie: California Tonalist Paintings 1890 - 1930 (TOM) 2 11 95 - 5 14 95, Laguna Art Museum 6 23 - 10 8 95
San Francisco Museum of Modern Art, Frank Lobdell: Paintings and Monotypes, January 20 - March 27, 1983. (Catalog published. Work reproduced on p. 27 with erroneous title of Spring 1978. An errata sheet corrected the title to Summer 1980.)