American baskets for bread, cake, or fruit are extremely rare. The monogram on the interior is for Susannah and Samuel Cornell. Myers made several objects for these wealthy patrons from New York and New Bern, North Carolina. According to the inscription on the underside of the basket, the Cornells later gave it to their daughter Hannah, who married Herman LeRoy on October 19, 1786.
Derived from Dutch, Scandinavian, and English sources, brandywine bowls were used on festive occasions such as the kindermaal, when women gathered to welcome a newborn child. Following Dutch custom, a bowl would be filled with raisins and brandy and passed from guest to guest. Here, boldly chased tulips create a sumptuous effect. The bowl belonged to Theunis Jacobsen Quick, a wealthy baker, and his wife, Vroutje 4516 Janse Haring.
Eighteenth-century easy chairs heavily padded, with thick down-filled cushions, and with wings to rest one's head against and keep drafts away-were often reserved for the elderly or the infirm. This New England example is remarkable for its elaborate upholstery and intact condition. The front is covered with Irish stitch needlework and the back with a needlework landscape scene. The seams are covered with silk tape. The frame is inscribed by  Gardner Junr,  presumably the upholsterer, and dated  Newport, May 1758. 
This painting is the major work that resulted from the artist's first trip to the West. His intention to create panoramic views of the American frontier was apparent by December 1858, just before he embarked on the trip. In early 1859 he accompanied a government survey expedition, headed by Frederick W. Lander, to the Nebraska Territory. By summer, the party had reached the Wind River Range of the Rocky Mountains in what is now Wyoming. Bierstadt dubbed the central mountain in the picture Lander's Peak following the colonel's death in the Civil War. This was one of a number of large works painted after Bierstadt's return from these travels. It was completed in 1863, exhibited to great acclaim, and purchased in 1865 for the then-astounding sum of $25,000 by James McHenry, an American living in London. Bierstadt later bought it back and gave or sold it to his brother Edward.
On June 4, 1845, Bingham returned from a winter stay in central Missouri to St. Louis, bringing with him several paintings and many sketches. This apparently was one of the pictures that he brought with him, and he sent it later that year for sale to the American Art-Union. It was first called  French-Trader-Half breed Son,  but the Art-Union gave it the title by which it is now known. Bingham, whose earliest efforts were portraits, produced a masterpiece of genre painting with little precedent in his oeuvre. The strikingly spare, geometric composition and luminist light recall the paintings of William Sidney Mount, particularly his  Eel Spearing at Setauket  (New York State Historical Association, Cooperstown). The solemn, motionless scene immortalizes the vanished world of the American frontier, constructed for a northeastern audience. The tranquil work was submitted to the Art-Union as a possible companion to the more implicitly violent  The Concealed Enemy  (Stark Museum of Art, Orange, Texas), in which an armed Osage warrior lies in wait behind a boulder. The polar opposition of quietude, savagery, and frontier danger embodied in the paintings held enormous appeal for urban viewers. Bingham painted a similar, though less extraordinary, picture called  The Trapper's Return  (Detroit Institute of Arts) in New York in 1851.
Beginning in 1891 Chase taught at a summer art school in Shinnecock, Long Island. The following year, he and his family moved into their new summer home, Shinnecock Hall, which had been designed and built by the well-known firm of McKim, Mead and White. Chase taught at the beach resort until 1902, conducting open-air classes for as many as a hundred students each summer. This work is characteristic of the outdoor scenes that Chase painted during the 1890s on Long Island beaches.
This picture was inspired by Church's second trip to South America in the spring of 1857. Church sketched prolifically throughout his nine weeks travel in Ecuador, and many extant watercolors and drawings contain elements found in this work. The picture was publicly unveiled in New York at Lyrique Hall, 756 Broadway, on April 27, 1859. Subsequently moved to the gallery of the Tenth Street Studio Building, it was lit by gas jets concealed behind silver reflectors in a darkened chamber. The work caused a sensation, and twelve to thirteen thousand people paid twenty-five cents apiece to file by it each month. The picture was also shown in London, where it was greatly admired as well.
Long known as  The Oxbow,  this work is a masterpiece of American landscape painting, laden with possible interpretations. In the midst of painting  The Course of Empire  (New-York Historical Society), Cole mentioned in a letter dated March 2, 1836, to his patron Luman Reed that he was executing a large version of this subject expressly for exhibition and sale. The picture was shown at the National Academy of Design in 1836 as  View from Mount Holyoke, Northampton, Massachusetts, after a Thunderstorm.  Cole's interest in the subject probably dates from his 1829-32 trip to Europe, during which he made an exact tracing of the view published in Basil Hall's  Forty Etchings Made with the Camera Lucida in North America in 1827 and 1828.  Hall criticized Americans' inattentiveness to their scenery, and Cole responded with a landscape that lauds the uniqueness of America by encompassing  a union of the picturesque, the sublime, and the magnificent.  Although often ambiguous about the subjugation of the land, here the artist juxtaposes untamed wilderness and pastoral settlement to emphasize the possibilities of the national landscape, pointing to the future prospect of the American nation. Cole's unequivocal construction and composition of the scene, charged with moral significance, is reinforced by his depiction of himself in the middle distance, perched on a promontory painting the Oxbow. He is an American producing American art, in communion with American scenery. There are both sketchbook drawings with annotations and related oil sketches of this subject. Many other artists copied or imitated the painting.
Daniel Crommelin Verplanck (1762-1834) was born in New York and spent the early part of his life in the family home on lower Wall Street. He was the eldest son of Judith Crommelin and Samuel Verplanck (39.173). While attending Columbia College (formerly King's College), he married Elizabeth Johnson, daughter of the president of Columbia. They had two children. Following her death in 1789, Verplanck married Ann Walton, with whom he had seven children. They lived on Wall Street until 1803 and then moved to Fishkill-on-Hudson, New York. He represented Dutchess County in Congress from 1803 until 1809. The portrait was painted in 1771 when Daniel was nine years old. The background has traditionally been identified as a view from the Verplanck country house at Fishkill, looking toward Mount Gulian.
Returning to Philadelphia from Europe in 1870, Eakins began a series of representations of the sport of sculling, a subject with which he is uniquely identified. This, the first major work in the series, probably commemorates the victory of Max Schmitt (1843-1900), an attorney and skilled amateur rower, in an important race held on the Schuylkill River in October 1870. Also an avid rower, Eakins depicted himself pulling the oars of a scull in the middle distance. Eakins constructed the painting according to the academic principles espoused by his primary Parisian teacher, Jean-Leon Gerome.
Earl portrayed the richly dressed dry goods merchant Elijah Boardman (1760-1823) in his store in New Milford, Connecticut. His right hand rests on a counting desk protected and decorated by green cloth secured with brass nails. The shelves of the desk house books, including Moore's  Travels,  Shakespeare's plays, Milton's  Paradise Lost,  Johnson's dictionary, and the  London Magazine  for 1786. Through the open paneled door to the right of the subject, bolts of plain and patterned textiles, including one with a prominently displayed British tax stamp, invite inspection and tell the viewer how Boardman earned a living, just as the books in his desk and the letter in his hand speak of his learning and awareness of culture. Earl also painted Esther Boardman, sister to Elijah (1991.338).
From 1845 until his death in 1880, Gifford chose Kauterskill Clove in the Catskill Mountains as one of his favorite subjects. This painting, dated 1862, was called  Kauterskill Falls  in the catalogue of the 1876 New York Centennial Loan Exhibition of Paintings, as well as in the 1881 official catalogue of Gifford's work. The title has since been changed to  Kauterskill Clove,  for the view is from the east, looking west to Haine's Falls at the head of the clove.
Heade became a good friend of the acclaimed landscape painter Frederic Church (1826-1900), but he worked on the periphery of the Hudson River School. He specialized not in dramatic wilderness subjects, as many of the school did, but preferred more prosaic marshlands and coastal settings. Even when he painted storms, as here, he portrayed not the actual tempest, but its tense preamble of blackening sky and eerily illumined terrain. This painting was based on a sketch of an approaching storm that Heade witnessed on Rhode Island's Narragansett Bay about 1858. The image became the basis for a more elaborate and synthetic version of the subject painted in 1868 (Amon Carter Museum, Fort Worth, Texas).
 The Gulf Stream  was based upon studies made during Homer's two winter trips to the Bahamas in 1884-85 and 1898-99. First exhibited at the Pennsylvania Academy of the Fine Arts in Philadelphia in 1900, the picture was subsequently reworked and  improved  by the artist. Early photographs show changes to the sea and to the back of the ship, making the composition more dramatic and vivid. The painting was shown in this state at the Carnegie Institute in Pittsburgh in 1900-01, and then at M. Knoedler and Co. in New York, where the artist placed on the picture the record-asking price of $4,000. There were problems selling the work because of either its high price or its unpleasant subject matter. Homer may have reworked the painting again in the face of this criticism in order to add the rigger on the horizon that signals hope and rescue from the perils of the sea.
The material that Homer collected as an artist-correspondent during the Civil War provided the subjects for his first oil paintings. In 1866, one year after the war ended and four years after he reputedly began to paint in oil, Homer completed this picture, a work that established his reputation. It represents an actual scene from the war in which a Union officer, Brigadier General Francis Channing Barlow (1834-1896) captured several Confederate officers on June 21, 1864. The background depicts the battlefield at Petersburg, Virginia. Infrared photography and numerous studies indicate that the painting underwent many changes in the course of completion.
Alfrederick Smith Hatch (1829-1904) was a prominent Wall Street broker in the firm of Fisk and Hatch and president of the New York Stock Exchange from 1883 to 1884. Like many of his business associates, he was an enthusiastic collector of art. One of the finest paintings in his collection was this commissioned group portrait showing three generations of his family. It depicts them in the library of their New York residence at 49 Park Avenue, on the northeast corner of 39th Street. Hatch is seated to the right at his desk, and his wife, the former Theodosia Ruggles (1829-1908), leans on the mantel. Other members of the family, including Theodosia's mother, Hatch's father, and their children are also present.
Leutze's depiction of Washington's attack on the Hessians at Trenton on December 25, 1776, was a great success in America and in Germany. Leutze began his first version of this subject in 1849. It was damaged in his studio by fire in 1850 and, although restored and acquired by the Bremen Kunsthalle, was again destroyed in a bombing raid in 1942. In 1850, Leutze began this version of the subject, which was placed on exhibition in New York during October of 1851. At this showing Marshall O. Roberts bought the canvas for the then-enormous sum of $10,000. In 1853, M. Knoedler published an engraving of it. Many studies for the painting exist, as do copies by other artists.
The full-length portrait of Susan Walker Morse (1819-1885), the eldest daughter of the artist, was painted during the crucial years of the invention of Morse's telegraph (ca. 1835-37). The painting shows the girl at about the age of seventeen, sitting with a sketchbook in her lap and pencil in hand with her eyes raised in contemplation. Although traditionally described as a Muse, the figure is more likely a personification of the art of drawing or design. Morse drew on the full extent of his European training, taking from the works of Rubens and Veronese in what was to be an ambitious farewell to his career as an artist. Stymied by a lack of financial success, he abandoned painting for science and inventing. This painting was first exhibited at the National Academy of Design in 1837, where it won enthusiastic praise. Susan married Edward Lind in 1839 and moved to his sugar plantation in Puerto Rico, returning often to New York to spend extended periods with her father, who had been left a widower when Susan was just six. She gradually grew less and less happy with her husband and plantation life. Lind died in 1882; in 1885, Susan set out to return to New York permanently but tragically was lost at sea.
On January 18, 1779, the Supreme Executive Council of Pennsylvania passed a resolution commissioning a portrait of George Washington for the Council Chamber and selected Charles Willson Peale as the artist. In preparation, Peale traveled to the Princeton and Trenton battlefields in February of 1779 to make sketches for the background. The original portrait, the full-length version now in the Pennsylvania Academy of Fine Arts, was a tremendous success and Peale completed numerous copies for royal palaces abroad, each time updating the general's military dress. This figure of George Washington was probably painted between June and August of 1780. In every other version, Washington is shown after the Battle of Princeton, but here he is depicted after the Battle of Trenton, the turning point of the war. It has been suggested that this portrait was commissioned upon the order of Mrs. Washington, because it is the only portrait in which Washington wears his state sword and because the painting descended in the Washington family.
The picture depicts a scene in the London studio of Benjamin West, who is generally agreed to be the figure standing at the left. Based on comparisons to self-portraits, Pratt is the man at the easel, an accomplished portrait painter. The identities of the other artists represented in the picture remain uncertain, but they are younger and they draw rather than paint. The composition explores the academic tradition as carried out among Americans in late-eighteenth century London.
This sculpture is a reduction of the Victory that is part of the Sherman Monument (1903; New York, Grand Army Plaza). The famed equestrian statue, dedicated to the Civil War hero William Tecumseh Sherman (1820-1891), is one of Manhattan's finest public sculptures, and a noble heir to the equestrian tradition begun in ancient Rome and continued through the Renaissance. Saint-Gaudens'  Victory  has traditional attributes-a laurel crown and a palm leaf-and is depicted by Saint-Gaudens as a guiding force. Her outstretched right arm leads the obediant horse, upon which sits a battle-hardened General Sherman. Saint-Gaudens painstakingly arranged drapery on numerous nude models for  Victory  before settling on what he believed was the perfect flow of her robe. Letters written by Saint-Gaudens near the completion of the monument reveal his triumphant feelings about the monument, and the figure of  Victory.  In a letter to his niece, Rose S. Nichols, he wrote,  It's the greatest 'Victory' anybody ever made. Hooraah! 
Madame Pierre Gautreau (the Louisiana-born Virginie Amelie Avegno; 1859-1915) was known in Paris for her artful appearance. Sargent hoped to enhance his reputation by painting and exhibiting her portrait. Working without a commission but with his sitter's complicity, he emphasized her daring personal style, showing the right strap of her gown slipping from her shoulder. At the Salon of 1884, the portrait received more ridicule than praise. Sargent repainted the shoulder strap and kept the work for over thirty years. When, eventually, he sold it to the Metropolitan, he commented, 'I suppose it is the best thing I have done,' but asked that the Museum disguise the sitters name.
Ward probably began  The Freedman  following Abraham Lincoln's Emancipation Proclamation, issued on September 22, 1862. The sculptor exhibited a model to acclaim in the annual exhibition of the National Academy of Design in spring 1863. Contemporary appreciation for the statuette arose from a desire for art that addressed current issues rather than less tangible themes unrelated to American life. Not only does  The Freedman  comment on the chief political, social, and moral topic of the era, but it also proclaims Ward's abolitionist sentiments. The seminude man sits on a tree stump, the manacle on his left wrist and the chain in his right hand potent reminders of his former servitude. Enhancing the statuette's powerful theme is Ward's commitment to realism. The fidelity to physiognomy and anatomical accuracy of the twisting body reveal an unprecedented naturalism in nineteenth-century American sculpture.