Bust of Frederick Douglass (1818-1895)  portrayed as a young man at the height of his power from photographs taken at that time .
Red male figure (modeled after Saint Sebastian) attempting to remove bramble that has pierced various portions of his body.
photograph of Ella Fitzgerald performing in a yellow satin dress; used by Pablo recordings.
Black baby doll with sleep eyes, movable arms and legs dressed in hand-made outfit.
A rather abstract still life painting of a vase of flowers resting on a table top with a smaller vase of pot containing a plant sitting next to it.
Altered version of United States flag with eight red & white vertical stripes, nine red & white horizontal stripes, with blue field depicting abstract white and black figures--on a black and white background split equally in half.
Painting of white and natural colored figures on three (3) different colored quadrants. The upper PL quadrant is blue.
Eight (8) framed correspondence note cards surround a photograph of James  Cool Papa  Bell and an autographed National Baseball Hall of Fame & Museum card.
Program dedicated to the  brave, determined members of the 99th Air Squadron, who stood the acid test while all the world looked on, and downed eight of the enemy planes manned by Germany's 'supermen' forcing the rest of the opposing forces to flee. 
Eight page booklet (playbill) for Duke Ellington's performance in  Jump For Joy  featuring Dorothoy Dandridge, Ivy Anderson and Herb Jeffries.
Small engraving of Fort Williams which was one of the many infamous slave forts that were built along Africa west coast in the 17th and 18th centuries. Extracted from Prevost's  L`Histoire Generale des Voyages  (vol. IV, no. 11).
Abstract lithograph in black, grey and beige colors. Edition number 62 150, signed in bottom right corner by artist.
photographic reproduction
Sheet music with illustration of cityscape in lower right portion of cover page. Total of six pages.
Man with (2) heads shown from frontal view, references to African heritage with Makonde influence.
Female figure balancing on proper left leg.  Emerging  refers to the female form that is revealed with the removal of the ceramic shell resin [investment] as part of the casting process. Part of the  dialogue series  see reference number 2002.4.
Striding woman balanced on proper right foot with hands on hip. Artist's proof. Part of the  dialogue series  see reference number 2001.10.
Larger than life male nude with hands placed over genitalia, gazing upward. Modeled after actor Djimon Hounsou.
Rosa Parks shown seated on a bus with White man seated behind her. She gazes out of the window.
Akua'ba fertility figure, cylindrical body, disk head, beautiful schematized coiffure on back of head suggests from core of Ashanti area.
Akua'ba fertility figure, good profile, repairs to neck
Akua'ba figure, fertility figure, beautiful assortment of small bead decorations.
Akua'ba figure, fertility figure carved and carried by pregnant women as symbol to insure birth of unborn child. High forehead symbolizes ideal beauty, articulated ringed neck reflects health, black patina, cylindrical body.
Akua'ba figure, fertility figure, black patina, bead decorations, interesting facial abstraction, good age.
Newspaper, ephemera and photograph scrapbook including an autographed publicity photograph of Sarah Vaughn (1950s).
Movie poster depicting scenes from Oscar Micheaux's thrilling motion picture epic,  The Betrayal: The Strangest Love Story Ever Told . Starring Lou Vernon and William Byrd.
Hermaphrodite, protruding stomach, anatomically female with a beard as male characteristic.
Male female pair, undetermined group. Two figures share on pair of over-sized legs. Simplistic, elongated bodily features reminiscent of Senufo rhythm pounders from the Ivory Coast.
Caricature of the donor, Vertenis Shephard, a family friend of Ken Renard.
Female figure, elegant angularity of body and legs with extensive scarification, protruding breasts. Left foot and head need repair, good age.
Hunter's shirt, cotton, Bamana, West Africa. Dark brown patina.
Bambara door lock.
Whitened mask with raffia , surmounted by stylized antelope form.
Red painted wood sculpture of standing male officer holding rifle in front of him. Traces of white and brown paint throughout figure with geometric design on base.
Standing monkey figure, some termites present
Collage painting of seated individual at a table with a bowl full of cherries and a vase.
Signed, titled and dated (August 1965) lower left. A deceased person is in an open casket with his head turned towards a grieving elderly man standing close by. A grieving couple stands on the other side of the casket and a minister stands behind a lecturn that has an open book on it, presumably a Bible.
Three patches of purple tints with half-circle shapes painted within the three purple areas.
Six page sheet music from the Radio Picture featuring illustrated caricatures of Amos and Andy and a dog on the cover.
Central female figure surrounded by images of a butterfly, leaves, moon and playing card stitched onto handkerchief.
Image of Sambo figure on cover of banjo case, wooden toy Sambo figure inside along with plastic rifle, mirror, transparency of male banjo player and metal skeleton figure with colored photocopy of lynched man. Also included is a large slice of watermelon made of wood with seeds attached to it.
Serigraph of garden of different shades of green with blue sky in background and sun.
Menagerie of colorful animals including a rooster, lion, horse and mythological mermaid holding a large red fish.
Girl walking holding a bird in left hand with the sun and moon shown above her. Edition 9 25
Mixed media assemblage: Central image of group of young african men participating in initiation rites surrounded by symbolic images of astrology and mysticism. Also included are plastic skeletons and a toy lion with skeleton head, all this set into a wood window pane frame.
Attached to the outside of the glazing is a found photo of a baby (representing imaginary playmate Rosey), placed in such a way so that the arch forms a halo over the baby's head. A rose is affixed to the baby's photo, directly below its body. Butterfly wings are pasted to appear inside the window in the photo. Signed and dated (1976) verso.
Edition 30 75, accompaning image for  Bookmarks in the Pages of Life: Six Short Stories by Zora Neale Hurston , 2000. Depicts (2) individuals and magnolia flowers.
Edition 30 75, accompaning image for  Bookmarks in the Pages of Life: Six Short Stories by Zora Neale Hurston , 2000. Depicts robed woman and caged bird.
Edition 30 75, accompanying image for  Bookmarks in the Pages of Life: Six Short Stories by Zora Neale Hurston , 2000. Depicts suited man and field hands with drum in foreground.
Edition 30 75, accompaning image for  Bookmarks in the Pages of Life: Six Short Stories by Zora Neale Hurston , 2000. Depicts standing woman and grandfather clock.
Edition 30 75, accompaning image for  Bookmarks in the Pages of Life: Six Short Stories by Zora Neale Hurston , 2000. Depicts (7) male individuals, donkey and quijada (lower jaw bone of donkey).
Edition 30 75, accompaning image for  Bookmarks in the Pages of Life: Six Short Stories by Zora Neale Hurston , 2000. Depicts (2) males in zoot suits and female figure in foreground.
Seventy-six page limited edition book containing (6) short stories:  Bone of Contention, Magnolia Flower, High John De Conqueror, The Conscience of the Court, Mother Catherine and Now You Cookin' with Gas . Each of the six stories is accompanied by an original illustration executed in serigraph.
The poster depicts a bull in a field with a stereotyped image of an older Black woman on a porch with a pipe in her mouth. There is a young Black child, in tattered clothes, eating watermelon at her feet on the porch, while one little boy is standing on a wooden fence peering at the bull.
Crocodile mask, surmounted by baby on back, won horizontally, plank-like mask.
Sepia tone photograph of young African American man (Prof. R. B. Smith  ) wearing small wire glasses and a dark suit, with right hand on wicker chair.
autographed publicity shot of Ella Fitzgerald which was given to a Western Union employee delivering flowers to the celebrated vocalist
Youthful Hazel Scott seated with proper right arm on back of chair. She is wearing a lace-patterned dress with sheer sleeves and bracelet.
helmet mask of Bundu Society
Do mask, zoo-morphic motif, depicting owl, concentric circle, bullet eyes, red, white, black polychrome, raffia
California Driver Licence issued to Thomas Bradley in 1995.
Bronze sculpture of male figure (God) holding smaller abstract figures in his arms.
Large bush cow mask, black and scorched dark patina, broken horns
bush cow, open jaws, asymmetrical eyes, white, black, red polychrome
bush cow, raised cross pattern on forehead, red and white coloration
Chamba Helmet Mask. Rounded eyes, red dots all over, two projections from forehead and two horns on the top of the head.
Abstract wood carving in teak or mahogany on black wood base.
Female figure balanced on proper left leg and arms in dancing motion. Edition 4 of 20. Part of the  Sisters, Bodies and Spirits  series.
Triptych portrait of African American womans face; first from left.
Triptych portrait of African American womans face; middle piece.
Triptych portrait of African American womans face; right-side piece.
Three photographs mounted on board; top left pictures two people at beach scene hunched over fallen individual; top right portrait of young White male; bottom pictures Ursa Major (The Big Dipper) in evening sky.
Collection of (24) letters and clippings pertaining to invention of the  Creep jack . This device invented by Mr. Robertson, was designed to move up to five rail cars on sliding without the need for a locomotive. The letters are written to a Mr. Robert H. Diggory of Wilkes Barre, PA who agreed to help with the invention for half interest in the patent.
Bas relief sculpture depicting lamenting after a lynching.
Miles Davis shown performing in profile.
oil on canvas
Signed and dated (1963) lower right. A solitary male figure stands on top of a heap of lumber. There was a forger of Charles White's work and the figure is under scrutiny by certain experts that it may not be White's. Possibly the study for  Birminham Totem , 1964 in the Collection of the High Museum of Art.
Profile of Mayor Tom Bradley (1917 - 1998)
Stylized portrait of bearded man.
Male and female workers in a field picking pecans.
(32) page British passport issued to Kenneth Renard at the Government House in the City of Port-of-Spain, in the island of Trinidad; documenting his arrival to the United States of America.
Candid shot of Leonard de Paur conducting the de Paur Infantry Chorus.
Program for concert at Webster Hall, Dartmouth College featuring Songs by Contemporary Composers, Folk Songs from Latin America, Songs from World War II, Negro Spirituals and Work Songs, and Songs of Faith.
movie poster, blue background, with Cuba Gooding Jr. Movie by John Singleton.
movie poster, with Sydney Poitier, Spencer Tracie and Katherine Hepburn. Edition# 67 304; Stanely Kramer, Director
Carbon-copy of a memorandum concerning artistic layout of an advertisement featuring the King Cole Trio.
classical style, slit eyes, brown patina, squared holes good for attachments, good age
Southern style mask, idealized features, stylized slit eyes, vertical scarification marks on forehead, accentuated teeth, incised grooves bordering mask representative of tribal tattooing. Material hiding eyes.
A doll's head, from a child doll, with paint dripping from it appears in the center of the canvas. It's as if the head were severed from the child's body and blood is dripping from it. The canvas at first glance looks solidly black but on closer examination stars, like the stars on the American flag, appear throughout.
A mousetrap, old radio tubes, a large bolt and a matchbox are placed at the center of an all black canvas.
A pair of child's hands reach out from inside of the box towards the viewers. The hands are located in the center of one side of the box.
Black box with circular hole cut in center showing plastic doll's hand and mouse trap inside.
Silkscreen depicting nine vertical slats with Black doll's head in center. Colors appear to be muted. This print was created from a photograph by the artist of his box. The original sculpture was sold to Lena Horne.
Blue, green red, and orange vertical lines running from top to bottom in varying widths on navy blue background on one side and on black background on the other.
Signed and dated (1957) lower right. Numbered and inscribed ,  Para Sonya y Eduardo Lypsett antiguos amigos de mi...Con profunda solidaridad de D. A. Siqueiros . This is a two-in-one portrait of a girl. Shown frontal and profile simultaneously.
Black, white and gray Artist Proof lithograph of abstract figures.
Body ink print of boy with face against the glass portion of door designated as  Admissions Office .
Wooden closet structure with iron skillets hung with wire coat hangers.
Layout drawing featuring the King Cole Trio, Ella Mae Morse, Martha Tilton, Bobby Sherwood and Jerry Colonna in an advertisement for Capitol Records, Inc.
Program listing performances; First Set: Sonny Stitt Quartet; Second Set: Lambert, Hendricks and Ross; Third Set: Lenny Bruce; Fourth Set: Terry Gibbs Quartet; Finale: Billy Eckstine. Cover and back illustrations by noted American painter David Stone Martin (1913-1992).
Decorative shadow box-like wall sculpture. The inside of this painted wood box is decorated with suspended fish-like elements and water pipes. The front of the box is covered with Plexiglas, the surface of which is decorated with lily pad elements, both in front and behind, as well as decorative surface painting in greenish swirls. The top surface of the box decorated with two upright elements painted with colorful acrylic washes, primarily in green with red, purple, orange and blue accents.
Garment stained with organic materials with several pouches sewn to the exterior.
Ceremonial object representing the hunter with his whisk.
Ceremonial object with leather handle adorned with cowry shells and whisk made of animal hair..
Garment stained with organic materials with several tassels sewn to the exterior.
multimedia sculpture
Temple-like sculpture-- an architectural mosaic that creates a visual narrative using broken bits of salvaged church glass and fragments of found shells which embellish the interior and exterior.
Moody conceived the obelisk-shaped piece as a symbol of Egyptian culture as well as a reference to the Washington Monument, which served as a setting for Martin Luther King Jr.s  I Have a Dream  delivered in 1963.
Knee-length pink dress with diagonal areas of pink beading in assorted patterns, a floral design in particular (matching pink beaded shoes AF19995.13.1b).
Pair of pink beaded shoes match to pink beaded stage gown (AF19995.13.1a)
Floor-length turquoise beaded silver lame stage gown
Floor-length gold lame gown with amber-colored rhinestones along neckline and waistline
Floor-length champagne and copper colored gown, with cooper colored cumberbund attached.
Raspberry colored two-piece gown with matching beading on sleeveless top.
Elderly man crossing street in the Watts section of Los Angeles.
Man with hat and gloves holding rug in the Watts section of Los Angeles.
Woman in front of parking meter on 103rd Street in the Watts section of Los Angeles.
Man in white T-shirt in front of pickup truck loaded with barber shop chairs in the Watts section of Los Angeles.
Three women at storefronts on 103rd Street in the Watts section of Los Angeles (woman on far right identified as Wilma Wren, stepdaughter of Candance Wren--who is photographer's aunt).
Three women at storefronts on 103rd Street in the Watts section of Los Angeles (seated woman on far right identified as Wilma Wren, stepdaughter of Candance Wren--who is photographer's aunt, center woman identified as Eloise, friend of Candance).
Two Army National Guardsmen with rifles on 103rd Street in the Watts section of Los Angeles.
Army National Guard truck in front of David Starr Jordan High School campus in the Watts section of Los Angeles.
Car being towed in front of burned bank storefront on 103rd Street in the Watts section of Los Angeles.
Three males among debris of looters in the Watts section of Los Angeles.
Army National Guardsman and students from David Starr Jordan High School in the Watts section of Los Angeles.
Group of individuals gather around looted materials at storefront in the Watts section of Los Angeles.
Man looting luggage from storefront in the Watts section of Los Angeles.
Students, residents and Army National Gurardsmen on David Starr Jordan High School campus in the Watts section of Los Angeles.
Residents gather along storefronts in the Watts section of Los Angeles.
Individual looting merchandise from 103rd Street storefronts in the Watts section of Los Angeles.
Two female shoppers converse with man at 1755- 103rd Street storefronts in the Watts section of Los Angeles.
Residents gather at storefronts in the Watts section of Los Angeles.
Man with broom at storefront on 103rd Street in the Watts section of Los Angeles.
Man wearing suit in front of Dr. Charles, Dentist storefront on 103rd Street in the Watts section of Los Angeles.
Bell shaped vase; Blue and white almost checkered design.
Teardrop shaped vase with heavy indenting and formed middle. Red orange glaze has been dripped on.
Teardrop shaped vase with blue glaze driped onto white background.
White vase with black cracks
Large brown vase with upper portion having red orange glaze
Teardrop shaped vase with blue glaze and irregularly indented middle.
Large vase with indentations around the middle. Brown glaze.
clay painting; red, green and black pigments
vase, blue and white splash design.
Teardrop shaped pot with red orange spotty glaze.
clay painting
Glazed fish facing right, beige and brown coloring. Possibly Southern Californian bass species.
Glazed fish facing left, beige and brown coloring. Possibly Southern Californian snapper species.
Glazed fish facing right,gold and brown coloring. Possibly Southern Californian bass species.
Glazed fish facing right,gold and brown coloring, crackle pattern on face and tail. Possibly Southern Californian bass species.
Glazed fish facing left, blue and tan coloring, raised beaded surface. Possibly Southern Californian barracuda species.
Glazed fish facing left, blue coloring, speckled pattern on face. Possibly Southern Californian bass species.
Glazed fish facing left, red, gold and black coloring. Possibly Southern Californian barracuda species.
Glazed fish facing left, gun metal grey coloring, crackle pattern on fins, face and tail. Possibly Southern Californian bass species.
Glazed fish facing left, brown, beige and gold coloring. Possibly Southern Californian snapper species.
Sixteen (16) page souvenir program from a performance of the Katherine Dunham Dance Revue  Bamboche!!  at the Fifty-Fourth Street Theatre in New York City. The production opened October 22nd, 1962 and ran for a limited engagement of only eight performances.
WWI Black soldier poster depicting cavalryman saying goodbye to his wife with a battalion shown marching in the background.
Bronze sculpture of musician, Lionel Hampton on marble base.
Bronze sculpture of blues singer Bessie Smith on marble base.
Bronze sculpture of jazz trumpeter Dizzy Gillespie on marble base.
Bronze sculpture of jazz trumpeter Louis Armstrong on marble base.
Sculpture projects the sense of motion of three calvary men on horses. Two of the three African American soldiers hold pistols and the third man brandishes a rifle. The men wear calvary uniforms.
Male figure playing a horn, Benin-style
Bronze Oba, Nigerian, with empty hands
Stereo card showing nine African Americans working the fields.
Center horizontal beam flanked by two semi-circles.
Correspondence, books, plaques, ephemera, a personal journal, historic documents, flight logs and paraphernalia pertaining to the life of Tuskegee Airman, Captain Edward L. Toppins.
Landscape scene of woman walking down dirt road in woods, two cows graze in field nearby.
framed pencil drawing
framed pencil drawing
framed pencil drawing
framed pencil drawing
framed pencil drawing
framed pencil drawing
framed pencil drawing
framed pencil drawing
framed pencil drawing
framed pencil drawing
old woman sitting down with basket signed lower right.
Eldridge Cleaver depicted as red cartoon character wearing a cross around his neck (possibly symbolic of Christian fundamentalist politics) and tearing off his spotted shirt ( changing spots  of former the Black Panther Party politics ). United States flag in background and Black protester in foreground (neglected constituents ).
Two Turkana women in a conversation distorted by elongating their reflections through a flexible Plexiglas-mounted mirror.
Portrait of young man in an Elite Studio portfolio
Geometric rendering portrait of an African American woman.
Originally released on Atlantic as  Ella Loves Cole  and then reissued on Pablo with two extra cuts from 1978, this set features the great Ella Fitzgerald (still in excellent form) backed by an orchestra arranged by Nelson Riddle performing an extensive set of Cole Porter songs. Fifteen years earlier Fitzgerald had had great success with her Cole Porter Songbook and this date, even with a few hokey arrangements, almost reaches the same level. Trumpeter Harry  Sweets  Edison and pianist Tommy Flanagan are among the supporting cast. Highlights include  I Get a Kick out of You, I've Got You Under My Skin, All of You, My Heart Belongs to Daddy and Just One of Those Things.  --Scott Yanow
A good title cut, strickly by the book.--Ron Wynn
Ella Fitzgerald, 42 years after her recording debut, showed on this late concert recording that she still had the magic. Backed by pianist Tommy Flannagan, bassist Keter Betts and drummer bobby Durham, she sounds pretty strong at times, mostly singing veteran ballads but also getting hot on  Billie's Bounce.  It's not essential but worth checking out. --Scott Yanow
Ella Fitzgerald, 42 years after her recording debut, showed on this late concert recording that she still had the magic. Backed by pianist Tommy Flannagan, bassist Keter Betts and drummer bobby Durham, she sounds pretty strong at times, mostly singing veteran ballads but also getting hot on  Billie's Bounce.  It's not essential but worth checking out. --Scott Yanow
Collage of guns, reclining people, brand name logos, flags and provocative signs surrounding a human skull.
Professional portrait of Thomas Bradley at beginning of his term as mayor of Los Angeles (1973 - 1993).
Boy and watermelon depicted with a wasp in foreground, poem reads  Watermellion's awful good, Possum's awful sweet, But EPICURE TEA is dreffel nice, And both of them can beat. 
Robust woman carrying two large brown bags.
Group of men playing pool at a local recreation center.
Salt shaker molded in the form of a Black housemaid wearing a kerchief, apron and carrying a platter.
Hand-separated printer's proof serigraph signed by Faith Ringgold. Depicts historic African American women quilting with Vincent Van Gogh admiring.
Hand-separated printer's proof serigraph signed by Faith Ringgold. Depicts dancing couples at the Savoire in Harlem. Celebrates the jazz of Dizzy Gillespie and Charlie Parker.
Sheet music composed by Abe Holzmann; photo of twenty African American boys in shirt and ties in an oval surrounded by decorative elements including a drawing of blackberries.
Sheet music composed by Abe Holzmann; photo of four African American boys in shirt and ties surrounded by decorative elements including smoke.
Program listing obituary and order of service for Tom Bradley's funeral.
Company  L  24th infantry military role call; Captain Raymond S. Stripling, Commander
Hazel Scott wearing burka with husband Reverend Adam Clayton Powell, Jr. (married 1945-1956) and son, Adam Clayton Powell, III photographed in Florence, Italy.
Oil painting depicting the story of How Malice Sent the Donkey to Marry the King.
Four women in foreground seated on the Caribbean seashore, basket of fruit on a blanket.
2 women with fruit
Two young women seated cross legged in an orchard.
oil painting no frame or glass
painting of three women talking in Haitian village with straw houses to the right of them in background
Portrait of woman with head scarf and crossed arms.
top-suspended with footstool, made in Japanese oak on wooden bearings of lignin vitae which are capped in ivory; coverings are gold-brown matching African goat skins.
Tree occupying center of composition lit by moonlight from behind. Shrubbery surrounding the foreground in a vibrant color palette.
Woman seated with her arms around her ankles gazing upwards to her right.
An engraving that shows an armed white plantation police man with a dog by his side inspecting passes of three black males with the use of a hand lamp. In the back four white armed men on horse can be seen roaming with the moon and the lake as a backdrop.
large scale work; images of Candice Bergen, Elizabeth Taylor, Nat King Cole and others on the mind of a black male in front of a fireplace with a red fox.
Full-face straight on stylized portrait of African American male in uniform.
Sheet music with illustration of cityscape in lower right portion of cover page. Total of six pages.
Black female figure with blue and white polka dot kerchief and matching ample dress to cover a toaster with her arms upraised.
fabric GPA crest with steel pins
LIFE magazine featuring Gordon Parks cover photography; signed by Gordon Parks November 2000.
lithograph
stock certificate
Two (2) stock certificates
lithographed billhead
landscape and buildings
landscape and buildings
landscape and buildings
landscape and buildings
landscape and buildings, both views on one (1) page
landscape and buildings
landscape and buildings
landscape and buildings
stock certificate; Northern Belle Mill & Mining Company, located Esmeralda County, Nevada; San Francisco, November 16, 1882. Certificate no. 14956 issued to C.C. Bayler, Trustee, for 50 shares.
stock certificate December 18, 1883, No. 24987 Shares 10
stock certificate, March 10, 1876, No. 133, Shares 50
stock certificate; Loretta Silver Mining Company. Ormsby County, State of Nevada. San Francisco, May 27, 1878; Certificate no. 153, issued to J.D. Ayres, Trustee, for one hundred shares.
stock certificate, July 20, 1877, No. 117, 10 shares
stock certificate; Metallic-Equator Considated Mining Company, Columbus Mining District, Esmeralda County, Nevada; San Francisco, November 7, 1881; certificate no. 36 issued to William Willis, Trustee, for one hundred shares.
lithograph, admission pass (ticket) for 8th Industrial Exhibition 1871
lithograph
Sheet music written by Harry James, Duke Ellington, Johnny Hodges and Don George; photo of Duke Ellington (bottom left corner), triangular graphic at center with two men and a woman inside--designed by Manning.
Quilt with no batting or backing material; colorful geometric shapes made with scraps of material, some diamond shapes.
Male mask, Guro people, Ivory Coast, West Africa. Animal head, biting stick in place.
Track # 3 identified as  A House is Not a Home  [Bacharach David] Ella Fitzgerald or Dinah Shore; track # 4 Lou Rawls; track # 6 Anthony Newley (recordings repeated on Side B).
An Artists rendering of Leimert Park Village.
Bill of Sale framed with Confederate currency, transcribed:  Received of Robert M. Scaff in hand the sum of fifteen hundred dollars payment in fool [sic] of a Negro girl named Sela, age about thirty-five years, alsow [sic] her child Charles a boy about 3 or 4 years old. Wich[sic] Negroes I warent [sic] to be sound in body and mind and slaves for life. I allso[sic] bind mi self [sic] mi [sic] heirs and assigns to warrent [sic] and defend the titel [sic] of sade [sic] Negroes to the sade [sic] R.M. Scaff his heirs and assigns forever agants [sic] the claims of all others. This 12th day of Oct 1860. H.R. Irwin 
photographic portrait of character actor Ken Renard with dark suit and tie, seated looking to his left
Mr. and Mrs. Horac[sic] Ross seated for their photo portrait.
Harper's Weekly illustration, A)  All The Diffence In The World: The Odor Of The Nigger (Republican) Is Offensive; B) But- 
Harper's Weekly illustration,   Negroes Driven South By The Rebel Officers 
White couple with Mervyn Dymally's son shown in front of a  Merv Dymally  poster. Man is kneeling to shake child's hand.
Assemblyman Dymally shown shaking hands with an unidentified politician in front of a map of Los Angeles.
Assemblyman Dymally finding a seat among a church congregation. (8) rows of folding chairs shown.
Assemblyman Dymally being presented a plaque by Press Secretary.
Assemblyman Dymally presenting a California Assembly Resolution to an unidentified couple.
Assemblyman Dymally presenting a California Assembly Resolution to an unidentified man with bow tie.
Mervyn Dymally shown at his home with wife, (2) sons and daughter. All are seated on a L-shaped sofa.
Assemblyman Mervyn Dymally shown at the office with an unidentified woman. Both are seated at his desk.
Sheet music written by Gene Jefferson and Leo Friedman; photo of Morris Manley in upper-right corner, drawing of African American male face with exaggerated eyes and lips wearing large bow tie and top hat (repeated three times).
Six member African American band photographed, from shortest to tallest, posing in front of their instruments (drums, banjo, trumpet, saxophone, and trombone) in blazers and bow ties. Lloyd Allen is the brother of Winslow F. Allen.
Two figures, a man and a woman with their arms about each other. The form of the figures is the distinctive of Hippolyte.
Lithograph of early view of San Francisco, possibly quite faded. From drawing by Henry Firk.
Print of watercolor depicting different types of hollow bottles.
Colorful print of two (2) faces and carnival scene with two (2) shining suns
Bald male figure, shirted, looking upwards.
Figure with bent knees shouldering a large box
woman with hair scarf holding swaddled baby in her arms
Drawing of Woman holding child on hip, framed.
Two color lithograph of girl with pigtail writing in book, 193 200
Drawing of Prime Minister Kwame Nkruma of Ghana, Africa.
(69) photographic  stills  from the film television theater career of character actor, Ken Renard and publicity shots.
(86) snapshots  on location  from the film television theater career of character actor, Ken Renard. Also included is a contact sheet of Lillian Hellman portraits.
(147) snapshots of the travels homes nightlife of character actor, Ken Renard. Some early snapshots from 1930 and 1931.
Jazz singer Billie Holiday (1915 - 1959) at microphone performing for  Stars of Jazz. 
Paul Robeson walking forward with his right fist and right foot bursting through  cover  of the California Eagle newspaper front page.
Jazz singer Billie Holiday (1915 - 1959) at microphone performing for  Stars of Jazz. 
Photographic prints, slides, transparencies, negatives and contact sheets of dignitaries, celebrities, models and musicians from 1940s  2003; including framed photographs, dry-mounted photographs, photo albums and master lists of artists all by Howard L. Moreheadestimated at over 2,500 pieces
Twenty-four (24) souvenir program for 1963 Miss Bronze California Beauty Pageant featuring an intermission starring Georgia Carr and Marilyn McCoo.
Calling card 1960 calendar for Howard Morehead featuring California Bronze models.
Painting with acrylic, tempera and gouache paint with postcards (from around the world) on museum board.
Green flyer announcing a birthday benefit for the Huey P. Newton Defense Fund on Saturday, February 17, 1968 at the Oakland Auditorium. $3 General Admission, $2 Student, $1.50 Welfare. Featuring Stokely Carmichael, Sister Betty Shabazz, Bobby Seale and Bob Avakian.
Classic face mounted on plaque, pink coloration, over-painted in black.
Standing male shrine figure wears wrist bracelets and anklets. Crested helmet shows extensive age. Probably once completely covered in white powdery pigment, now traces left.
Face mask, wood, Ekpo male society mask to honor dead ancestors, calm expression type. Face surmounted by seated articulated female figures, polychrome.
Carved wooden doll with movable arms; this doll type represents the anticipated idealistic beauty of the first child of the doll's owner. Young Ibibio girls before initiation into adulthood, are put into seclusion, taught feminine roles and encouraged to gain weight to become more attractive as a bride and mother-to-be. Articulated arms, classic hair style, traditional form of concentric circular rings at waist, beautiful naturalistic features, white and black coloration.
Blackened surface, sharply articulated features, evidence of attachments
Two levels; 3 faces separated by wooden columns, second level has four stylized heads.
Head crest of northern Ibo, surmounted by abstracted female figure, articulated arms, black, white, red polychrome.
Seated monkey figure, hands to eye and tongue, open mouth, gray with kaolin, broken phallus
Bio Helmet Mask, Janus form, one face is black and the other tan. Deep carving and scarification in high relief with snake and lizard motif encircling top portion above faces. A large spoke like projection on either side of  headdress  section of mask with mirrors affixed to their centers.
Ibo mask of male face covered in animal skin with reddish pigmentation. Male and female figures with moving arms on top. Also a mirror fixed to back of mask on proper right side. side (others probably originally attached but now missing). Polychromed: blue, white, black and red paint.
Figure representing fattened initiate; body painted pink with traditional body paint of black curvilinear lines; four cone-like braids; articulated arms; wearing three hip rings
Horizontal mask in the form of an anteater, thousands of scales carved in relief, phallic appendages, dark patina, red and black coloration
Wood figure, angular style characteristic of southern Ibo. Symbolizes ancestor, serves as shrine statuary, venerated to contact spirit world.
Face mask, wood, Ibo Igala people, Nigeria, West Africa. Represents maiden spirit, danced by Mmwo, mens secret society. Expressive face, stylized hairdo, surmounted by hat; white, green and black polychrome
Six-page comic book based on the London Stump Book version of this rhyme; concludes with  Taffy was a Welshman  rhyme. Title changed to  Ten Little Indians  in 1964 when published by Pocket Books.
Printed fan club card with Kriegsmann photo on reverse, signed by Hazel Scott.
Program listing performances; First Set: Sonny Stitt Quartet; Second Set: Lambert, Hendricks and Ross; Third Set: Lenny Bruce; Fourth Set: Terry Gibbs Quartet; Finale: Billy Eckstine. Cover and back illustrations by noted American painter David Stone Martin (1913-1992).
Guere, black painted wood mask with red and white over eyes.
serigraph
Artist representation of the revolt of fifty-three Africans against enslavement onboard the Amistad in 1839.
Brightly colored silkscreen (From An American Portrait 1776-1976)
serigraph
Serigraph print depicting Haitian General Toussaint L'Ouverture.
Silkscreen print edition 29 120. Depicts group of men on horseback capturing male figure in red coat and black hat on white horse.
Consists primarily of text from the Old Testament, Book of Genesis interspersed with eight (8) color silk-screens.
One (1) framed original color lithograph created in celebration of the adoption and ratification of the Fifteenth Amendment to the United States Constitution. Published by Thomas Kelly of New York from the original design by James C. Beard.
Assemblyman Mervyn Dymally looking upward at the 1964 Democratic National Convention in Atlantic City, New Jersey. Signs for Edmund G. Brown and Lyndon B. Johnson are visible.
Youthful Hazel Scott head shot wearing lace-patterned dress and pearl earring (proper left only).
Youthful Hazel Scott head shot looking over proper left shoulder wearing lace-patterned dress with pearl necklace and earrings.
Youthful Hazel Scott head shot looking over proper left shoulder wearing lace-patterned dress with pearl necklace and earrings.
Hazel Scott dressed more conservative in basic black photographed with her husband Adam Clayton Powell (married 1945 -1956), Jr. and their son, Adam Clayton Powell, III  Skipper .
Portrait of Rachel (1908-1927) and her mother, Kate L. Brown in the woods with a stream in the foreground.
Ella performing in red dress.
Ella performing in black dress.
(2) identical playbills from Broadway production of Jean-Paul Sartre's  The Respectful Prostitute  featuring Ken Renard.
painting
Final print proof, BAT  bon a tirer  proof
 When The Ethiopian first appeared, all civilization was moved by the astounding nature of its revelations, as well as by the compelling power of the narrative itself. In the adventures of this Ethiopian Oxford graduate whose contact with a white woman causes him to backslide into the most medieval practises of his race, you will find mirrored the whole Ethiopian country; its deserts, plains, mountains, rivers and plateaus --around which beats today the fierce light of history in the making . From book sleeve.
Abstract color patches with three individuals on right-hand side.
Twenty-four page (12 leaves) pamphlet for Duke Ellington's  Jump For Joy  performance at the Mayan Theatre in Los Angeles with Dorothy Dandridge, Ivy Anderson and Herb Jeffries.
Twenty-four page (12 leaves) pamphlet for Duke Ellington's  Jump For Joy  performance at the Mayan Theatre in Los Angeles with Dorothy Dandridge, Ivy Anderson and Herb Jeffries.
Artist's proof of winged man falling towards earth.
assemblage in assemblage
assemblage in ammunition box
assemblage in ammunition box
assemblage in ammunition box of female figure constructed with a  hoe  used to create her pelvis.
assemblage in ammunition box
assemblage in ammunition box
assemblage in ammunition box
assemblage in ammunition box
assemblage in ammunition box
Welded steel sculpture incorporating white and red hexahedrons, parts of lock cylinders, pliers and magazine clips.
Composed of drawers-containers including sardine can, images of Akuaba dolls, slaves and bottle rack. Flag pole mounted on top and shark mounted beneath. Flag contains an image of Middle Passage slave ship quarters.
Two jazz musicians shown with their instruments (saxophone and trumpet) surrounded by vibrant colors in almost a Cubist rendering. Image used to promote the 1991 Mountreux Atlanta International Music Festival.
Two jazz musicians shown with their instruments (saxophone and trumpet) surrounded by vibrant colors in almost a Cubist rendering. Image used to promote the 1991 Mountreux Atlanta International Music Festival.
Two jazz musicians shown with their instruments (saxophone and trumpet) surrounded by vibrant colors in almost a Cubist rendering. Image used to promote the 1991 Mountreux Atlanta International Music Festival.
Two polychromed hexahedrons with parts of a gun welded between them mounted to a steel plate with a steel rod. The hexahedrons are colored with red, white and blue paint.
Slag incorporating bolts and scrap metal mounted on steel base with a steel rod fastened to a wood hexahedron.
Mixed-media sculpture, in the shape of an ironing board. Support legs in the shape of a stylized animal, the front leg appears as a grazing animal head, with a painted bell around its neck. Rear support leg in the shape of animal legs with stylized feet. Top surface of board has 7 flat irons, 6 are standing up and one on its side. 5 of the 7 irons have multi-colored rags wrapped around their handles. The board is decorated with 5 colorful painted fields. Head of front leg has carved shell-like ears, red jewel eyes and painted surface.
sculpture in form of large flute.
mixed media and steel assemblage
Twenty-two (22) small shotgun house structures mounted on rough hewn wood posts.
Wooden outhouse structure with two wheels mounted on right and left exterior sides. Inside is plastered with text, photographs, a light, and audio recording. Outside shows stenciled dates.
bronze sculpture of classical female nude
Poster advertising the first annual John Coltrane Festival at USC and Griffith Park in Los Angeles. Photograph of John Coltrane at top with text above and below the image.
Synthetic dark brown wig belonging to Ella Fitzgerald made by Joyokalon
Black and white photograph of a mature Ms. Rosa Parks wearing glasses and gazing to right of window.
Kigango, EWZK 07
Stereo card showing six African Americans picking cotton in Texas.
Stereo card showing six African Americans picking cotton in Texas.
A reconstructed 1930's chair with enamels, photographs, quotes and a radiator base. The sculpture is a homage to Ms. Rosa Parks, Civil Rights activist whose refusal to give her bus seat on December 1, 1965 lead to the bus boycott in Montgomery, Alabama.
Framed book  1993 published in conjunction with Kim Abeles: Encyclopedia Persona, A Fifteen-Year Survey at the Santa Monica Museum of Art; curated by Karen Moss. The encyclopedia includes an entry on Rosa Parks and To Sit As Ladder (In Honor of Rosa Parks), which is a sculpture by Abeles that was donated to CAAM in 1992.
Business card announcing a benefit for the King Hotel on Sunday, November 9, 1958 with a $2 donation.
Grebo mask, symbol of chief's power, boldly abstracted, concave face, round protrusion for mouth,
Reddish brown with black highlights. Ornately carved wooden mask with large protruding eyes and nose. Forehead has sharp ridge with round projection atop head as ornamentation raffia embellishes bottom of mask at neck with multi-triangular design around protruding mouth. Exceptional.
an installation of ceramic artwork incorporating water fountains
(6) String instrument with cowry beads depicting a human face on the arm and the (2) protruding handles from the gourd resonator. Leather is stretched over the gourd resonator with cowry beads decorating the edges.
Sheet music written by Henry Busse, Henry Lange and Lou Davis; drawing of African American male in tuxedo playing the trumpet.
Sheet music written by Walter Donaldson; drawing of elderly African American male seated on a bale of cotton playing the accordion, three children dance to the tune and a river steamboat is seen in the background; photo of The Four Aristocrats featured in bottom right corner.
Image from the historic March on Washington.
Image of the Mississippi delegation from the historic March on Washington.
Image of the famous operatic vocalist at a podium from the historic March on Washington.
Image from the historic March on Washington.
Image of publishing giant, John Johnson and company from the historic March on Washington.
Image from the historic March on Washington.
Image of Martin Luther King, Jr. at a podium from the historic March on Washington where he delivered his  I Have A Dream  speech.
Image of John Lewis at a podium from the historic March on Washington , leader of the Student Nonviolent Coordinating Committee (SNCC).
Image of folk singer, Josh White at a podium from the historic March on Washington.
Image from the historic March on Washington.
Image from the historic March on Washington.
Image from the historic March on Washington.
Image from the historic March on Washington.
Image from the historic March on Washington.
Image from the historic March on Washington.
Image of the civil rights leader at the podium from the historic March on Washington.
Image from the historic March on Washington.
Image from the historic March on Washington.
Image of the popular folk trio from the historic March on Washington.
Image of the  Renaissance Man , Gordon Parks from the historic March on Washington.
Portrait of Thelonious Monk surrounded by books and piano keys
Bound paper book, missing cover, compiled from official authentic documents.
Reproduction of badge issued to Thomas Bradley (1917 - 1998) by the Los Angeles Police Department displayed in an acrylic case. Imprinted with Bradley's identification number, appointment and retirement dates.
Standing male ancestor figure, asymmetrical body, blackened patina, carved coiffure
Standing Janus-form figure, Kabeji, brown patina, hole on top of head for fetish material, shallow carving, male female
Self-portrait of the artist with Nigerian conceptual artist Ik Ud. Harris and his collaborator are portrayed as a dandyish couple on the cover of a fake Ebony magazine. The taller Ud, on the left, holds his arm around Harris's shoulder and wears a tie.
Six-page comic book based on the London Stump Book version of this rhyme; concludes with  Taffy was a Welshman  rhyme. Title changed to  Ten Little Indians  in 1964 when published by Pocket Books.
Headdress, Chi Wara head piece with antelope figures; Typical vertical form of mother with offspring on back; long straight horns with incised spiral design on both; atop basketry cap covered with black braiding. Carved in traditional style but not ritually used.
Bush cow mask
pyro-engraved wooden table made for export; carved figures and African mammals
(9) pieces of braided steel sculptures
sculpture of steel cables twisted like a rope
Sculpture comprised of five (5)  bundles  of twisted wire.
From the edition limited to 400 copies signed by the author and artist; a set of six color lithographs from 1992 illustrates the stirring poem For My People, written by Catlett's friend Margaret Walker in 1937. The poem mourns the losses, chronicles the endurance, and celebrates the survival of African Americans and looks to a future of liberation and justice. Distributed by The Limited Editions Club, New York.
mixed media wall sculpture
Flag of the United States at top center surmounts insignia for the National Rifle Association, a quote and bowl of tomato soup on a black field.
Abstract geometric shapes concentrated in the center of the paper; circles are filled in with color.
Sketch of female nude figure reclining with head on some sort of padding.
Black chair with shirt draped on the backing.
Wood abstract sculpture with wide base, flattening towards top.
Abstract wood sculpture
Lithograph
A heart is apparent in the top left side of the work with a rectangular shape at the center, which is hollowed out.
Top third of painting solid mauve color, remaining is vibrant pastel metallic markings clustered around five-point star geometric shapes.
Two diamond-shapes interposed with religious symbols drawn in gold over green pigment.
Two joined square-shaped panels with nine gold leaf circles to visualize the Sun's rotation.
Mask with a vertical hair-do, good age
Helmet mask, wood, Mende Temne people, Sierra Leone, West Africa. Four posts supporting divination for hairdo
Cloth checkerboard patterned headdress flanked with raffia. Two raffia bands worn below knee, oval-shaped animal skin shield worn over abdomen and raffia ring. Thirteen wooden planks dangling from backside of headdress.
Cast bronze of elderly man with a book, robe, and cane
quilt, applique technique with painted areas (textile paints)
Mixed media sculpture depicting the hostilities between the Los Angeles Police Department and Rodney King. Depictions of Police Chief Darryl Gates and Mayor Tom Bradley (1917 - 1998) in clown make-up as well as images of the four police officers accused of Rodney King's beating.
Organic sculpture
First edition monograph of Miguel Covarrubias Negro drawings that contains his significant work over a period of three years. It is designed and arranged to afford a comprehensive idea of the most provocative aspects of Negro life in America, especially Harlem, complete with fifty-six (56) drawings and frontispiece.
Green hat with pea-green colored tulle by Mildred E. Blount and colored sequins.
Brown hat with rust-brown colored tulle by Mildred E. Blount
Small round brown hat with sequins and beading by Mildred E. Blount.
The Cotton Club presents RhythMania;sheet music written by Ted Koehler and Harold Arlen; drawing of dancing smartly-dressed African American couple (repeated pattern); designed by Gladys Helmund.
A Black man smoking is reproduced three times at the lower center of the piece while the artist plays with the expression  role model  and  roll model.  A chicken and a  time to jump ship   are placed on the left bottom corner. Phrases throughout the red and yellow canvas.
Lists recipe for  American Pie  including crust and filling with Chef's suggestion; slice of pie featured in top right corner on white field above  Reparations ; deconstructs American history through a recipe that contrasts crust and filling, patriotic idealism and social reality. Muted American flag in background.
Patchwork quilt of pastel pinks, greens, mint, violet and floral scraps of fabric. Nineteenth century patterns with twentieth century fabrics.
Abstract female fertility figure
bush cow, elongated muzzle, in-curving horns
Address given by Miss Anderson to her class at Los Angeles High School.
Young blonde girl wears short pink dress, white boots and blue ribbon in her hair. Jointed arms and legs.
Young blonde girl wears chiffon white dress with flowers and silver ribbon attached below PR hand, silver slippers and wedding veil in her hair. Jointed arms and legs.
Young blonde girl wears mauve-colored dress with flowers and pink ribbon attached below PR hand, silver slippers and mauve-colored bonnet with flowers in her hair. Jointed arms and legs.
Young brunette boy wears black tuxedo pants and jacket with white shirt and bow tie and black slippers. Jointed arms and legs.
Young Black girl wears red white gingham dress with white kerchief and apron, and black boots. Jointed arms and legs.
Young brunette boy wears red pants, horizontal red white stripped shirt, large white collar with red ribbon and black slippers. Jointed arms and legs.
Young brunette girl wears red white checkered dress, white apron, white bloomers, red ribbon in her hair and black slippers. Jointed arms and frozen legs.
Young brunette girl wears yellow flower-print dress, yellow apron, white bloomers, yellow bonnet and black slippers. Jointed arms and legs.
Young brunette girl wears red dress with white chiffon, incorporating red heart, white chiffon bonnet, lace-tipped bloomers and black slippers. Jointed arms and legs.
Young blonde girl wears silver colored dress with lace, incorporating flowers, blue bonnet, bloomers and black slippers. Jointed arms and legs.
Souvenir specimen from the Moon Flight Apollo 8 presented to Tom Bradley. Framed fragments of the ablative heat shield, gold and aluminum mylar which protected the spacecraft from radiant heat by reflecting the sun's rays.
Research certificate awarded to Marvyn Dymally [sic] for purchasing The Negro Heritage Library.
mask, face with eyelashes (female ), wearing headdress
Altar-piece, Benin-style, with Oba supported by retainers
Bronze vessel (a) with Statue of king wearing necklace for lid (b). King holds scepter-like object (c), the bdbe, in right hand and a small male figure (d), royal subject or prisoner, in the left hand. Four (4) pieces total.
Mwo maiden's face mask. White pigment on face with traces of black on forehead, eyebrows and ears. Also red pigment on lips and scarification on both sides of nose.
Full standing female figure painted pink; wearing striped, short western-style dress; snakes encircling waist; separately carved larger snake craved in three parts and nailed together and which fits into upraised arms of figure; facial marks painted in black; atop irregular curvilinear base.
Shadow box stage-like set, in miniature, with large central assemblage hanging above lower scene with black white floor. Ladders and red curtains at back, curtain pulleys at rear. Layered scale-like shapes of glued paper, with wood, fabric, egg, lace, jewels, paint, cord, and metal.
Composed of actual burnt wood and other debris from the Watts Riots of 1965. Large abstract fields of color, primarily blues, greens, whites and ochre, with charred wood. Raised letters in center black field reads  SIGNS . Raised letters in round lower-left field reads  ALWAYS BE CAREFUL .
Commemorative 3  button with image of Martin Luther King, Jr. and words: Nonviolence  Precious Lord, Take My Hand. 
The cradle has an oval configuration. It was constructed using bentwood slats that curve down to form a flat bottom. The cradle is hung from the frame. It is attached on each end to the frames eyebolt. Below the eyebolts are two curved runners.
Black rag doll wearing overalls and red print shirt.
Young man seated on a stool in front of a backdrop depicting a country wooded scene; his jacket is draped over a prop and his PR arm rests on the jacket.
Semi-circle token in the shape of a  C  worth one slave; removed from a wrecked schooner rigged sail.
retrace nose
Karikpo mask, black and white, hinged jaw
Derived from Ibibio, horn-like coiffure of Karikpo, black and white, articulated jaw, facial scarification, good condition
Ogoni puppet mask
(2) identical promotional flyers for the film  No Way Out . Pictured are the stars Kevin Costner, Gene Hackman and Sean Young. Flyers belonged to Ken Renard.
Plate reproduction of original, edition number 70 500. Face of black, green, blue on white ground.
United States Passport issued to Mayor Thomas Bradley noting his international travels from 1995-1998.
three-pointed crown of chief, one point missing
Contemporary kente cloth of Kenya, handwoven strip cotton textile
hand-woven Afro-Caribbean doll that depicts a black female in native Caribbean attire
Los Angeles City Council Members. Front row (seated left to right): ..., Ernani Bernardi, John G. Gibson, Jr., Billy G. Mills and Robert J. Stevenson. Back row (standing left to right): Arthur K. Snyder, Edmund D. Edelman, Robert M. Wilkinson, Gilbert W. Lindsay, Joel Wachs, John Ferraro, Louis R. Novell, Tom Bradley and Marvin Braude.
Artist holding a ceramic pot she created with her familiar Ndebele design incorporated on the pot, her textile and mural in background.
Three females with initiation painted faces and head scarves.
Row of fifteen (pictured) dancing women in line
Seated initiates in circular formation with their feet coming together in the center, initiation paint visible on their legs
Female chest and torso shown with initiation ceremony paint
dancing women
two figures seated
1919 calendar showing Black soldiers returning victoriously from WWI shaking hands with Uncle Sam. Cover page for calendar reads  Greetings. May good fortune be with you throughout the ensuing year. 
Plaque honoring Mayor Tom Bradley for his ground-breaking vision and successful legacy to enrich the lives of Los Angeles children and their families.
Mervyn Dymally shown photographed in the California State Assembly. He is shown seated at the bottom row, fourth from the right.
Group photograph of women in the Women's Army Corps of Fort Lewis, Washington.
Image of civic leader and educator who founded the Palmer Institute, Charlotte H. Brown.
Image of elderly woman sitting on a bed
Woman playing the harp in an evening gown.
Image of Lena Horne with WWII GI's in front of the Booker T. Washington Memorial at Tuskegee Institute
Portrait of blues composer and musician William Christopher Handy
Portrait of lyric tenor Roland Hayes
Image of botantical researcher and agronomy educator George Washington Carver painting a still-life
Image of seated boy on staircase
Portrait of jazz composer lyricist bandleader playwright Noble Sissle
Portrait of elderly black man
Program for their first civilian tour of America and Canada; complete with bio and photographs.
Promotional commemorative pamphlet honoring The Infantryman; Black soldier with rifle and bayonet featured on the cover.
Punu people, Gabon, West Central Africa. Represents female spirit, used by men's society. White patinated face, carved coiffure of black and red.
Baseball signed by old Negro League players: Andy Porter (Baltimore Elite Giants) , Sammy Haynes (Kansas City Monarchs) and Lonnie Summers.
Framed color photograph of Mayor Tom Bradley descending staircase with Queen Elizabeth II, carrying a bouquet of roses, to his right. Photograph was taken during the Queen's visit to Los Angeles in 1983 on the steps of City Hall. Yvonne Braithwaite Burke and Ethel Arnold Bradley also featured.
movie poster; Bruce Ricker, Director; featuring Count Basie and his Orchestra and Big Joe Turner.
Original sculpture of welded bronze. It consists of a series of soaring abstractions suggestive of flight, with wing-like and wave-like elements, lifting above the earth and encouraging aspiration.
Brown-orange hard back cover book
bust of man on blue background; near photo-realism
Bust of Mary McLeod Bethune with hair pinned-up and wearing a necklace.
Smartly dressed seated seven-member African American band, posed with their instruments (drums, trombone, trumpet, saxophone, (2) clarinets, grand piano and violin). Lloyd Allen on trombone is the brother of Winslow F. Allen.
acrylic on canvas
watercolor diptych, study for the original painting
painting of Italian landscape signed lower middle, framed (no glass)
Painting of an italian landscape and lake with two small figures in foreground. Two sailboats are pictured in the background.
painting, signed and dated Paris '62 on reverse framed (no glass)
Scene depicting red colored Christ on cross as orange and yellow male figures are on crosses nearby. Female blue figure and orange male figure stand on ground between crucified figures.
Rosa Parks peers out of the window of a friend's home in Los Angeles. She is shown drawing back the curtains.
Collage of female figure washing herself as older woman sits in chair nearby, cat in foreground.
Print of woman in gingham dress and sun hat tending to her garden. House and hills in background.
Print referring to the classical Greek myth of The Judgement of Paris. A male figure sits under a tree as three female figures (goddesses) appear before him, each vying to be chosen the most beautiful.
Print referencing Salome in the Bible. She carries the head of John the Baptist on a platter as others stand nearby and watch.
Female and male figure beneath a fruit tree with reference to ancestors and self in a triangular formation in background.
Print of woman in red and white dress carrying basket. Birds, fish, fruit and trees surround her.
Reference to Noah's Ark, where Noah sends out a messenger bird. Male figure stands on deck of large sailboat at sea with swirling waves.
Couple shown quilting in their place of residence.
Interior home scene of woman teaching a young girl to play the piano.
White ceramic plate with gold lettering and trim. Plate commemorating Suffragan Bishop Chester L. Talton consecrated January 26, 1991. Picture of Bishop Talton on front in official vestments
Executed in a brown camaieu palette
Executed in a strong expressionistic style and in a palette with yellow and black predominant.
Portrait painted on found railroad board with heavy crackling.
Organic figure drawn in black, pink and orange.
Stereo card showing seven African Americans cutting sugar cane.
Abstract organic composition with blue circles and yellow splattering.
cardboard model
 This painted aluminum relief is a collage in the tradition of Afro-American abstraction.  (SG)
movie poster, Danny Glover holding cards; Charles Burnett, Director
movie poster, Robert Townsend, Director
movie poster, movie by Matty Rich
mixed media assemblage; reference to domestic violence.
Twelve (12) pieces panels total including a cup, each with text telling a story about Mrs. Whitehead and her late husband.
two slightly abstracted figures singing with a stringed instrument.
b w photo of Ella Fitzgerald wearing evening gown
Senufo mythological bird
Sheet music written by Geo.B. Wehner and Louis Breau; pink text box in lower right quadrant announcing Eddie Cantor in  The Midnight Rounders. 
Sheet music written by Mort Dixon and Harry Woods; drawing of elderly African American male facing a river next to a cabin; photo of Julian Woodworth in bottom right quadrant.
Four member African American band photographed playing their instruments (keyboards, saxophone, drums and trumpet) in suits and ties.
Bundu-style helmet mask. Female face with small open slit eyes with three vertical scarification marks below eyes; carving with Loma influence; five-lobed, crested hairstyle with crescent braid at top; braided detail on back.
An engraving on newsprint that shows four black men acting on a rickety wooden stage. They are all dressed in European influenced costumes. Offstage another black male can be seen reading from a book.
flag, South African (pre-apartheid)
flag, South African (post-apartheid)
Official program booklet celebrating the first anniversary of the assassination of Martin Luther King, Jr. held at the Shrine Auditorium in Los Angeles.
Stereo card showing African American boy with a hammer and wrench scratching his head with a bicycle tire in front of him. Cat and man with a hat in background.
Black and White hands grasped in a handshake with  SNCC  lettering beneath.
woodcut print of Frederick Douglass
Large scale work of white bird (crane  ) and shadow of fox-like animal behind it. Spots of bright primary colors, blue, yellow and red, in work.
Three faces in right side profile silhouette, one beige, one reddish, and one purple. The two faces at left are semi-concealed with a transparent wash in the shape of aheart. The right face appears to be kissing a large golden bird (crane ) in flight.
Sketch of bird incorporated into a heart-shaped object.
Sheet music; published by permission of Victor Kremer Co. Chicago Music Section, Chicago Sunday Examiner, May 26, 1907-Pages 17-20.
Business card advertising King Hotel with 115 newly decorated rooms, 75 with bath.
Seventy-six page limited edition book containing (6) short stories:  Bone of Contention, Magnolia Flower, High John De Conqueror, The Conscience of the Court, Mother Catherine and Now You Cookin' with Gas . Each of the six stories is accompanied by an original illustration executed in serigraph.
Stereo card showing two African American women (one breast feeding) with four children in front of a doorway.
(23) volumes of the Official Quaterly publication of the College Language Association. Published by Morgan State College in Baltimore, Maryland.
A collection of images from a specific time period that were brought together because of their interest for Statom. Many of the elements are the fanciful recognizable ones that he has explored before such as games combined with natural objects.
This early issue contains articles including the slave trade defended, War with Spain, Parliamentary debate, trade issues, among others. Also, each issue contains letters from readers, stories, poetry, Foreign Affairs, Marriages, Births, Deaths, History, etc.
Tall figure with removable pelvic plate revealing face of a baby; arms represented by wheels, head absent with large organic headdress.
Photograph from Mango Creek, Belize included in  Tengo Casi 500 Aos: Africa's Legacy in Central America  exhibition.
Photograph from Nicaragua included in  Tengo Casi 500 Aos: Africa's Legacy in Central America  exhibition.
Stereo card showing African American women on a flatboat with rice-straw.
Yearbook of the United States Army Negro Chorus documenting the organization of a chorus of 200 African American soldiers to sing a program of  Negro spirituals  and folk songs in concert with the London Symphony Orchestra at the Royal Albert Hall, London.
U.S. Army commission signed by the President of the United States and Secretary of War. Framed with a brass plaque that reads,  Theodore Roosevelt commissions Allen Allensworth, one of the first African American Chaplains in the United States Army, as a Major. This document is also countersigned by future President and Supreme Court Chief Justice William Howard Taft. Document signed December 30, 1904. 
U.S. Army commission signed by the President of the United States and Secretary of War.
Bound publication featuring the Constitution and Book of Laws for the organization created by Marcus Garvey. In effect July 1918. Revised and Amended August 1920 and August 1921.
movie poster, blue background, 2 men and 1 girl. Movie by Spike Lee.
Autographed concert program detailing the performance itinerary of Paul Robeson, assisted by Clara Rockmore on Theremin.
Application file page for student George Poage from 1903
Black female doll wearing navy blue and white polka dot dress.
Young woman standing against chair
Two young women dressed in white
Baby in white on wire chair
Three photos, two of young boy in cap. One of mother and child
Baby seated on small wooden chair
Collage of ten photos of well-dressed people
Possible Church group with banners in front of building
Graduating Class
Male dwarf with two women, and man in background
Two photos; one with three women on pier, the other of a seated woman outdoors
Boy at school desk
Business card for Rev. H. Devereaux with photo on verso.
Standing uniformed man outdoors
Two photos; one of uniformed man with woman, the other of standing woman outdoors
Two photos; one of two young women (Hazel and Lela), the other of middle-aged woman (Mrs. Devereaux) leaning on tree stump
Young gentleman in hat and overcoat
Young posed couple
Young seated woman with gloves and hat
Young Lollie standing on a chair
attributed to a slave collar.
Certificate of Citizenship documenting the naturalization of Ken Renard.
Photograph of Big Joe Turner receiving an award certificate from Los Angeles Mayor Tom Bradley (1917 - 1998) for his outstanding contributions to the field of entertainment. Photograph in enclosed in glass and framed.
Sword, civil war era, with scabbard. Brass twisted wire hilt and mounts. Probably US Government issue.
Boxer shown with left fist raised and left foot forward, his shadow is cast on the American flag. Reproduction of signature at bottom right corner.
Sixty-four (64) photographic portraits that capture the diversity of community involvement by African Americans in Los Angeles ranging from religion to economics.
(20) documents including correspondence, reviews and playbills relating to character actor, Ken Renard. Funeral program is also included.
(45) photographs of Tom and Ethel Bradley including: marriage photo (1941), promotion to LAPD Lieutenant (1958), with JFK, mayoral inauguration, with Dean Martin, Ricardo Montalban, Marian Anderson, Ella Fitzgerald, Arthur Ashe, Elizabeth Taylor, Sammy Davis Jr., President Jimmy Carter, Prime Minister Kriangsak Chomanan of Thailand, Ted Kennedy, Pope John Paul II, HRH Prince Charles, Bill Cosby, Prince Ranier of Monacco & Princess Caroline, Magic Johnson & Lionel Richie, and Nelson Mandela (not complete list).
Over two hundred eighty-seven (287) vintage antique Black Americana collectibles like Mammy and Aunt Jemima cookie jars, salt and peppers, string holders, wall plaques, figurines, sheet music, tobacco and other memorabilia and African American ephemera
LA's Black photographers present a new perspective on their city; featuring the photographic work of: Roland Charles, Don Cropper, Jeffrey, Karen Kennedy, Willie Middlebrook, Nathaniel Bellamy, Calvin Hicks, Mike Jones, Ron Lyons and Akili-Casundria Ramsess.
Recalls the New Testament accounts of Jesus Christ's death. On that day storms arose and the  sun refused to shine . The crucifixion is symbolized by a cross, tinged in red, that appears in the lower half of the painting.
Colorful organic floral shapes dominate the painting, representing the artist's femininity.
Linoleum cut portraying influential blues musician Marion  Little Walter  Jacobs (1930-1968) with harmonica.
Linoleum cut portraying the  Queen of Salsa  Celia Cruz (b. 1929). Celia Cruz reflects the African base of Afro-Latino music as popularized in Afro-Latin Jazz and salsa. Depicted with elements of salsa.
Linoleum cut portraying Louis  Satchmo  Armstrong (1901 - 1971) with his trumpet. Louis Armstrong, more than anyone, else was responsible for legitimizing and popularizing jazz for a wide audience.
Linoleum cut portraying  Eribangando  which represents one of the seven Irimes (apparitions of the liturgy of the Abakuas of Cuba) in charge of purifying the utensils that were used in the religious ceremony.
Linoleum cut portraying a band of six male Cuban musicians from Havana. This kind of group originated in Havana in the 1920s to interpret the  sones  (Afro-Cuban dance music that combines African percussion and rhythmic patterns with Spanish stringed instruments and lyrical styles.
First edition book of this story of Emma Lou Morgan where the peculiar conflicts that exist within the Negro society are exposed for the first time.
A two page pamphlet advertising the real estate development of the Leimert Park area. The pamphlet has artist renderings of future housing development on the front and back covers
A brochure by the Walter H. Leimert Co. advertising the Leimert Park area. The front of the brochure has a photo of a young woman sitting by a window with palm trees and greenery visible through the window. Back of brochure details in writing the successful history of Leimert Park and also lists a map of the downtown Los Angeles that demonstrates the convenient location of Leimert Park.
A pamphlet by the Walter H. Leimert Co., Inc. advertising that only 192 lots are available for purchase in Leimert Park.
A brochure by the Walter H. Leimert Co., Inc. aiming to demonstrate to prospective home buyers the idealness of the Leimert park area through the use of photos, facts, expert opinions, etc.
Signed and dated (1961) lower right. In addition,  imp , which is an abbreviation of  impressit , indicates that the artist is also the print maker. An African American girl stands in the midst of a field of beautiful flowers on a sunny day.
movie poster; Gordon Parks, Director
movie poster; Spike Lee, Director
movie poster; Steven Spielberg, Director
Sheet music written by Sam Lewis, Joe. Young and Geo. W. Meyer; photo of man in Black face with a person in a donkey costume holding a bottle of whiskey, background is a drawing of a tropical island scene.
stage photograph of unidentified woman leaning against staircase banister
stage photograph featuring Ken Renard on far-right with (2) unidentified actors. Center figure is seated in a wheel chair and far-left actress portrays a housemaid.
Seven-member band (two trombones, banjo, saxophone, trumpet, piano and drums) on a parade float for promoting  greater movie season . Lloyd Allen is the brother of Winslow F. Allen.
Postcard of the Dunbar Hotel in Los Angeles;  115 Rooms--75 Rooms with Bath. Rates $1.00 Per Day and Up. Weekly Rates $5.00 and Up. 
A Harper's Weekly engraving that shows blacks cowering and praying in the cracked streets of Charleston after a strong earthquake occurred. In the back a fire can be seen burning a building.
One pound coffee tin depicting African American woman with kerchief serving coffee on a platter.
Painting depicting running man with umbrella.
Woman seated on chair shelling crawfish with turtle depicted in lower right corner.
Image of daily life of residents of New Orleans, fish market depicted.
Young girl shown seated on a floor.
African American man shown standing at a pool table with  eight  ball and pool stick. He wears a necktie and cap.
African American man shown in undershirt drinking a bowl of soup.
African American couple shown outside of cabin with images of people in the windows.
African American woman wearing a kerchief is shown through a window of cabin with sunflowers visible alongside the window pane..
Portrait of an African American woman wearing a hat and earrings.
People on Haitian street in bustling marketplace. A few women are carrying baskets of goods on their heads.
Harper's Weekly engraving that portrays a middle-aged black man and a young black man hunting on a snowy Christmas Eve. A hare can be seen escaping, leaving snow prints behind as a stunned black boy holds a trap in his hand and his shocked father looks on.
Speech delivered by Representative William Slade of Vermont to the U.S. House of Representatives on January 18 and 20, 1840. Printed by Gales and Seaton.
Black and white photograph of (L to R) Pat Hendricks, Tyne Daly, Ella Fitzgerald and Georg Stanford Brown
Smartly dressed standing African American woman, posed with her hand turning pages in a book with a chair behind her. Backdrop displays an outdoor staircase.
Staff figure, wood, Wurkun people, Nigeria, West Africa. Figure surmounts iron stake, kept in a hut at center of village, and set in ground to protect crops. Incised geometric patterning of forehead, articulated teeth, deeply carved abdomen and belly button-like delineation and protrusion from top of head.
For most of his tenure as Mayor of Los Angeles (1973 - 1993) this portrait graced the walls of his office in city hall.
Ere Ibeji twin figure, wood, Yoruba people, Nigeria, West Africa.
Divination tapper, Ifa priest taps against divination board at beginning of ceremony, calling on Orisha, god of human destiny. Slender pointed end, balanced on kneeling female figure, holdoing implement in front of her in supplicant pose to deity of personal destiny. Archaic style, excellent patina, erosion on right side of face.
Figurative posts found in courtyards and verandas of chief's houses; male standing figure holds knife and axe in his hands.
Gelede headdress, wood, Yoruba people, Nigeria, West Africa. Red and black polychrome; corn-row hairdo
Gelede headdress, wood, Yoruba people, Nigeria, West Africa. Egungun type, depicting stylized rabbit, danced for the mothers. Classic form, emphasis on gazing eyes, facial scarification. Islamic designs and talking drum.
Face mask, wood, Yoruba people, Nigeria, West Africa. Epa mask, simplistic face, kneeling figure on top.
Ere Ibeji figures, twin female figures, beautiful patina, conical hairstyle, beaded adornments added as symbols of wealth and prestige.
Dorsal head, both female, indigo decoration on head.
Dorsal head, both female, indigo decoration on head.
Ere Ibeji figure. Aluminum and beaded armlets, bullet lead eyes, male female. Decorations added by mother of twins to honor Ro, goddess and protector of mother of deceased.
Ere Ibeji figure, Oyo-style figures, abstracted, exaggerated arm fors, two males, gnawed by rats.
Ere Ibeji figure, Oyo-style figures, abstracted, exaggerated arm fors, two males, gnawed by rats.
Ere Ibeji figure. Aluminum and beaded armlets, bullet lead eyes, male female. Decorations added by mother of twins to honor Aro, goddess and protector of mother of deceased.
Eshu figure, Shango standing devil, subject of Ifa ceremony, represents good and evil, phallic form of hair-do extends backwards, cowrie shells hang from neck, beaded long hat surmounted by bird, cowry, leather, wood, amulets among attachments.
Very well carved pleasing face with three ovoid scarification marks on each cheek; well-defined ear detail; remains of supports for missing superstructure
Circular form, Eshu depicted with abstract facial features surrounded by one rope of cowry shells on one side; one rope of seed beads on other two bars as horizontal divider horn on each side trapezoidal forms with cross hatching surrounding recessed trapezoidal form across from Eshu; back with recessed circular area; indications of much use.
Gelede Headcrest elaborate detailed carving; face incised, face painted light blue with chalk-like pigment; eyes and turban of turquoise and white bands; some Islamic influence; much use and age indicated.
Egungun headcrest with human-like face and large rabbit ears with a talking drum between them. A hyena stands upright at back of mask behind ears. Traces of pigment throughout mask
Round Ifa divination board
Formal Chieftain Robes, male, 3 parts
Tenor saxophonist Zoot Sims recorded quite a few albums with pianist Jimmy Rowles during his Pablo years; all are recommended. Rowles assisted Sims in coming up with obsurities to interpret, and this recording is highlighted by such little-performed songs as  If I'm Lucky, Shadow Waltz, Gypsy Sweetheart and I Wonder Where Our Love Has Gone.  The lead voices are backed ably by bassist George Mraz and drummer Mousey Alexander on this enjoyable straight-ahead date.--Scott Yanow
Seventy-six page limited edition book containing (6) short stories:  Bone of Contention, Magnolia Flower, High John De Conqueror, The Conscience of the Court, Mother Catherine and Now You Cookin' with Gas . Each of the six stories is accompanied by an original illustration executed in serigraph.