Formerly in the collection of:The artist's student, Mrs. M. Noble Brainard, 1868-1901.Acquired in 1901.
Theodore Scott DaboDIA in 1906
Gift of the artist,  January 8, 1906.
Gari MelchersEdward Chandler Walker. (purchased from the artist in 1906).DIA in 1906
artist to New Montross Gallery to DIA, 1906.
Mrs. John L. Gardner, as early as 1880.Acquired in 1907.
William Morris Hunt studio sale, Horticultural Hall, Tremont Street, Boston, February 3-4, 1880, no. 27, as Ball Players, Magnolia, 1877.  Mrs. John L. (Isabella Stewart) Gardner.  Acquired in 1907.
Collection of James E. Scripps until 1907. Donated by family after Scripps's death.
Percy Ives (Commissioned by the museum board.)DIA in 1907
Julius C. RolshovenDIA in July 1907 (purchased by museum subscription)
John Henry TwachtmanCharles Lang Freer (purchased from the artist through M. Knoedler and Co., NY, with DMA director Armand Griffith acting as agent), 1908DMA in 1908
Edward Chandler Walker.DIA in 1908.
Private collector, London, to Newman Montross Galleries. Montross to DIA, 1908.
Artist to dealer Arthur P. Yorston, New York, ca. 1889; to Edward Chandler Walker, ca. 1909; To DIA in 1909 (with dealer Arthur P. Yorston acting as liason).
Elizabeth NourseInternational Art Union of ParisDMA in 1909.
The artist, until at least 1903.William O'Leary Gallery, Detroit.Acquired in 1909.
DMA purchase directly from the artist, September 2, 1909. William Yawkey Fund.
James Frederick Joy, Detroit, ca. 1873-74 until 1896.Mrs. James F. Joy, Detroit, 1896 until 1910.DIA in 1910.
Mary M. Stevens, until 1910.Acquired in 1910
Birge Harrison (purchased from artist in November, 1910)DIA in 1910
Willard Leroy MetcalfThe Montross Galleries, (Metcalf's Dealer)DIA in February of 1910.
Frederick E. CohenRobert Hopkin, Detroit; Mrs. Robert Hopkin, DIA in 1910.
Charles Caryl ColemanDIA in 1911
Charles Willis Ward (commissioned by same in 1907).DIA in 1911.
Purchased from artist on August 14, 1911.DIA in 1911.
John francis MurphyDIA (from artist through his dealer, Knoedler) in 1912.
Sir Francis Baring, Bt., London, 1802; his son, Sir Thomas Baring, Bt., 1848.Baring sale, Christies, London, June 2-3, 1848, lot 26.A. Leonard Nicholson, London.Acquired in 1913.
The artist to his wife, Florence M. Shirlaw, 1901Mrs. Shirlaw to DMA, 1913
Robert Reid (purchased from artist)DIA in 1913
Edward C. WalkerDIA in 1913
Jonas LieDIA (City of Detroit purchase, May 22, 1914); purchased directly from the artist.
Sergeant KendallDavid GrayDIA in 1915
Macbeth Gallery, New YorkDIA in 1915 (purchased with funds provided museum-board member Elliott T. Slocum)
Charles Willis Ward DIA in 1915.
Formerly in the collection of:Dexter M. Ferry, Jr., Detroit.Acquired in 1915.
William Merritt ChaseDIA in 1916
Richard Emile MillerWilliam MacBeth (purchased from the artist).Hugo Reisinger, purchased in 1912. DIA in 1916. (purchased from the Reisinger estate through the American Art Galleries, January 1916).
Frank Weston Benson (the artist)DIA in 1916
Robert SpencerDIA in 1916 with funds provided by Miss Julia E. Peck
The artist to Samuel A. Coale until 1881 (listed in 1881 sale catalogue as  A Venetian Fish Market ). P.A.B. Widener, Philadelphia to Mrs. P.A.B. Widener, Haverford, PA.American Art Association sale purchased by M. Knoedler and Company for the DIADIA in 1916.
George Wesley BellowsDIA in 1917 (Purchased from the artist on 6 14 17)
Artist's estate, 1908, San Francisco 1916, no. A-4.Pasadena 1917, no. A-4. Mrs. George O. Robinson.  Acquired in 1917.
James Carroll BeckwithDIA in 1917JAmes Carroll BeckwithDIA in 1917 (Gift of the artist)
Almeda H. Pickering, Los Angeles, California.Acquired in 1917.
Purchased from artist in 1918.
Robert HenriDIA in 1919 (purchased form the artist in October).
Robert HenriDIA in 1919 (purchased from the artist in October).
Childe Hassam until 1919.DIA in 1919 (purchased from the artist in March of 1919).
Frederick Carl FriesekeDIA in 1919
Leon KrollDIA in 1919. (subscription fund and gift from J. J.  Crowley)
John Singleton CopleyMrs. john Singleton CopleyJohn Singleton Copley, Jr. (Lord Lyndhurst)George Boone Roupell, Charthan Park, near East Grinstead, EnglandBrigadier George R.P. Roupell, Little Chartham, Shalfors, Surrey, England,Sale, Sotheby's, London, November 21, 1979, lot 120H. Schickman Gallery, New YorkDIA in 1983
Henry Siddons Mowbray to Thomas B. Clark, New York, by February 1889;Miss Grace Hearn, by 1897;Private collection, New Jersey, before 1980;  Jordan Volpe Gallery, New York, 1980; Grand Central Art Galleries, New York, 1980; Mr. and Mrs. Haig Tashjian, before 1982; Joan Michelman, Ltd., 1984DIA in 1984
Henry D. Shelden, Sr; Allan Shelden III Mrs. Allan Shelden III, Detroit.Acquired by bequest in 1985.
Mary CassattThrough the Family of Alexander CassattRobert Cassatt.  Alexander Cassatt (the sitter's great-grandson). DI A in 1986
Formerly in the collection of: Mrs. Gordon V. K. Reid
Stanford White.  Associate of Stanford White.Descendant of August Belmont.George Guerry, 1962.Mr. and Mrs. George J. Arden, New York, 1968-87.Berry-Hill Galleries, New York, 1987.DIA in 1991.
Kidde Family, Chappaqua, New York, 1930; Babcock Galleries, New York, 1932; Milch Galleries, New York, by 1932; Stuart Pivar, New York, by 1987; Jordan-Volpe Galleries, New York, 1987-1992; DIA in 1992.
John Singer Sargent; to sister Emily Sargent until 1936;Emily Sargent to sister Violet (Mrs. Francis Ormond) until ca. 1948;Violet to son Henri Eric Conrad Ormond until 1979;Henri Eric Conrad to his son, John Ormond, until ca. 1993;to Coe Kerr Gallery, New York;to DIA in 1993.
Arlington Art Galleries, Brooklyn.Mack Pratt, Hamilton, Ohio.Private collection, Hamilton, OhioJordan-Volpe Gallery, New York.DIA in 1993.
Colonel J. G. Moore, New YorkPrivate collectionsGraham Williford, New YorkJordan-Volpe Gallery, New YorkAcquired in 1994
Elihu Vedder, to 1880.Wellesley College, Wellesley, Mass., 1880, gift of Elisha S. ConverseHirschl & Adler Galleries, New YorkAcquired in 1957
Private collection, house on Mission Hill, milton, Mass.  Mrs. Brundidge of Milton, Mass., or of Hyde Park, ca. 1916.  Adelson Gallery, Boston.  Ira Spanierman, New York.  Drawing Shop-Galerie, now Shepherd Gallery, New York 1966.  On consignment at Kennedy Galleries, New York.  Richard Manoogian, Detroit.  Kennedy Galleries, New York.   Shepherd Gallery, New York 1984.  Private collector, 1984.  Joseph Feldman, Mich., 1984.  His wife, Sally Feldman.  DIA 1993.
Private collection, house on Mission Hill, Milton, Mass.Mrs. Brundidge of Milton, Mass., or of Hyde Park, close to Milton, ca. 1916. Adelson Gallery, Boston.Ira Spanierman, New YorkDrawing Shop-Galerie, now Shepherd Gallery, New York, 1966.On consignment at Kennedy Galleries, New York.Richard Manoogian, DetroitKennedy Galleries, New YorkShepherd Gallery, New York, 1984Private collector, 1984Joseph Feldman, Mich., 1984; His wife, Sally Feldman.Acquired in 1993
The artist to Emil Rothengatter, New YorkBy Family descent to his great-granddaughter.Adelson Gallery, New York, 1994.Acquired in 1994.
Maxim Karolik collection, Newport, RI., 1959.  Mr. J. Watson Webb.  His wife, Electra Havemeyer Webb.  Shelburne Museum, Shelburne, Vt. Altman Burke, New York.  Acquired in 1991.
Robert Barr.  Barr's widow.Kennedy Gallery, New York, through a London dealer who acquired it from Mrs. Barr.Witenagemote Club, Detroit, 1920.Acquired in 1920
Gift of Ralph Harmon Booth on 12 31 19.
Presented by the artist through his sister, Mrs. Ellie Stewart Brolemann.DIA in 1921.
William McGregor Paxton  (purchased from the artist by the Founders Society, Merrill Fund)DIA in 1921
John Singer Sargentto Frank Bramley, Worcestershire, England, until 1920sold at Christie's London, May 28, 1920, lot 131M. Knoedler & Co., New York, 1920 (lot no. 15064)John Levy Galleries, New York, May 1921DIA in 1921.
Dr. Charles Hitchcock, until 1922.Acquired in 1922
Mary Cassatt, ParisDurand-Ruel, New York Cyrus J. Lawrence, New York American Art Galleries, New York, Cyrus J. Lawrence Sale, 1910. James Stillman, Paris.Dr. Ernest G. Stillman, New YorkDIA in 1922, from an anonymous donor [Dr. Ernest G. Stillman].
Henry Brockholst Ledyard.  To his children, Baroness Von Ketteler, Henry Ledyard, and Hugh Ledyard.  Acquired in 1923.
Jacob H. Schiff,  New York.On consignment, Anderson Galleries, New  York, 1922.Acquired in 1923.
Ernest LawsonRichard H. Webber (purchased directly from the artist through his dealer, Charles Daniel).Gift of Richard Webber to DIA in 1923.
Founder's Society Purchase directly from artist, 1924.
Maurice Prendergast until 1924;to Charles Prendergast (brother), 1924; to Daniel Gallery, 1924; purchased by Dexter M. Ferry, Jr., 20 May 1924;to Detroit Museum of Art, 1924.
George LuksDIA on Feb 18, 1925 (City of Detroit purchase, directly from the artist through his dealer, Macbeth)
The sitter's grandson, Thomas A. Sutherland, San Diego; an unidentified descendant, 1926. Gump's Gallery, San Francisco, 1926.  William Macbeth, Inc., New York, 1926.Acquired in 1926.
Formerly in the collection of:The sitter's grandson, Thomas A. Sutherland, San Diego; an unidentified descendant, 1926Gump's Gallery, San Francisco, 1926.William Macbeth, Inc., New York, 1926.Acquired in 1926.
A. B. Davies John Quinn, New York, purchased in 1915 (conflicting views say it was commissoned and purchased from the artist or purchased from Montross Gallery). Ralph Booth, purchased through the American Art Association Association, New York, Feb. 10, 1927 DIA on Feb. 27, 1927.
Montross Gallery, ca. 1914; John Quinn, 1915; Estate of John Quinn, 1924; American Art Association, 1927 City of Detroit purchase for DIA, 1927
Colonel Frank J. HeckerDIA in 1927
Colonel Frank J. HeckerDIA in 1927
Colonel Frank J. Hecker (Commissioned for the Hecker home)DIA in 1927
Mrs. Clark Gayton, 1779-1809; Reverend James Pigott, 1809-22, her third husband; Lydia Pigott [Mrs. William Thresher], his daughter, Fareham, Hampshire, England. Captain W. Thresher; R.N., Avenue End, Fareham, Hampshire; Lucy Mabel Thresher, his niece. O'Hagan sale, Christie's, London, November 24, 1922, lot 106.M. Knoedler Co., London.Woolworth sale, American Art Association, January 5-6, 1927, lot 876Metropolitan Galleries, New York, 1927DIA in 1927.
Purchased from Susan Macdowell Eakins, the artist's widow, through Clarence W. Cranmer, Philadelphia, in 1930.
Purchased from the Kraushaar Galleries, New York, in 1930.
The artist's family until 1917.Purchased by dealer William Macbeth, New York, 1917 (purchased for $600  from American Art Association sale of artist's works).Purchased by dealer Newman Montross, New York, 1923 (through the American Art Association for $325).Mrs. Arthur McGraw, ca. 1923 (most likely from Montross and the above sale) .Gift of Mrs. Arthur McGraw to DIA, 1931.
Theodor Lagerquist (dealer), Berlin, Germany.DIA in 1934.
Alexander Ionides.Alecco Ionides George McCulloch, London, 1895; to his widow, Mrs. Coutts Michie, 1907William O'Leary Fine Arts, Detroit, until 1911.Henry Glover Stevens, Detroit, 1911 Acquired in 1934
Philadelphia Art Union.Western Art Union, Cincinnati.Captain WatermanMrs. E. M. Brady.Dr. and Mrs. James Cleland, Jr.Acquired in 1934
John D. Fisher, Boston, 1835Mrs. Samuel Hammond, BostonVose Galleries, Boston, 1935DIA in 1935
Fomerly in the collection of:The artist's son, William S. Page, 1893; his son, George S. Page, Pittsburgh, 1936 (owned jointly with his wife, Delilla B. Page, his sons, Blinn S. Page, Grosse Pointe Park, Michigan and Lowell Briggs Page, and his daughter, Mrs. Leslie Stockton Howell, Philadelphia).Gift of George S. Page, Blinn S. Page, Lowell Briggs Page, and Mrs. Leslie Stockton Howell in 1937.
Fomerly in the collection of:The artist's son, William S. Page, 1893; his son, George S. Page, Pittsburgh, 1936 (owned jointly with his wife, Delilla B. Page, his sons, Blinn S. Page, Grosse Pointe Park, Michigan and Lowell Briggs Page, and his daughter, Mrs. Leslie Stockton Howell, Philadelphia).Acquired in 1937
The  A. B. Frost Family.Sold from the collection of Henry W. Lanier, American Art Association, Anderson Galleries, Inc., New York, Feb 11, 1937, lot 102.Purchased by Dr. Karl Lilienfeld, Lilienfeld Galleries, New York, for the Detroit Institute of Arts.Acquired in 1937.
Purchased from Frederic Frazier, Inc., New  York.Acquired in 1938.
Formerly in the collection of:The sitter's great-grand-daughter, Mrs. Charles H. Metcalf, Detroit.Acquired in 1938.
The artist's descendants.Charles Q. Archdeacon, Stony Brook, New YorkCharles J. Werner, Stony Book, New York, until 1917.Norman Hirschl (dealer), New York, 1938Acquired in 1938.
Dalzell Hatfield (dealer), Los Angeles, 1938DIA in 1939
Thomson Gallery, 1939Acquired in 1939.
Mr. and Mrs. Charles Savage Homer, Jr.Mr. Arthur Homer.Macbeth Galleries, New York.Acquired in 1940.
Mr. and Mrs. William d. Biggers, until 1941.Acquired in 1941.
John Montresor (the sitter), Belmont, Facersham, KentSir H. T. Montresor (his son), Dene Hill, KentLt. Col. H. E. MontresorCharles M. Montresor (his brother), Stoneley GrangeLt. Col. E. H. Montresor (his son)Mrs. Joan Montresor Read (his daughter) The Montresor Family Howard YoungFeragil Galleries, New York, 1941DIA in 1941.
The sitter's grandnephew, William Bradley, Greenfield Hill, Fairfield, Connecticut, 1948; his daughter, Mrs. E. B. Morehouse, Greenfield Hill; her son, Louis E. Morehouse, Westport, Connecticut, 1941Acquired in 1941
Malcolm Sands Wilson, New York, 1940John Levy Galleries, New York, 1941Acquired in 1941
Formerly in the collection of:Dexter M. Ferry, Detroit; Mrs. Blanche Ferry Hooker, Detroit, 1941.Acquired in 1941.
Formerly in the Collection of:Blanche Ferry Hooker, Detroit, 1941.Acquired in 1941.
Formerly in the collection of:The sitter's family.John Levy Galleries, New York, 1942Acquired in 1942
Downtown Gallery, New York.Mrs. Lillian Henkel Haass, 1932.Acquired in 1943.
John Gray, 1766-82Judge John Gray Otis, Boston, 1873Judge John Gray Rodgers, Boston, 1899The Misses Rogers, by 1908Mrs. W. Arthur Dupee, 1928-43M. Knoedler Co., New York, 1943DIA in 1943.
Samuel A. Eliot (Mayor of Boston, commissioned this work)the family of Mrs. S. A. Eliot, 1876Mrs. Henry W. Foote, Boston, 1881Mrs. Roger B. Merriman (dealer), Boston, 1943DIA in 1943 (gift of Dexter M. Ferry, Jr.)
Formerly in the collection of:Joseph Patterson; the Patterson family, Pittsburgh.A.F. Mondschein (dealer), New York.Acquired in 1943.
artist until 1917.American Art Association in 1917, to Alfred Rose to Henry Monroe Campbell, Sr., to Henry Monroe Campbell, Jr., to DIA in 1943.
Formerly in the collection of: The sitter, Thomas Chamberlaine, to 1786; Samuel Chamberlaine; his son, Samuel Chamberlaine, Jr.; his son, Dr. James E. Muse Chamberlaine; his daughter, Elizabeth Bullock Hayward; her son, J. Chamberlaine Hayward.  M. Knoedler Co., New York.Acquired in 1944,
Loammi Baldwin, Boston, 1827 Mr. and Mrs. James F. Baldwin, 1839Mrs. George R. Baldwin, 1876William Morris HuntM. Knoedler Co., New York, 1944DIA in 1944.
Possibly Nathaniel Amroy, by September 1825Possibly Robert Gilmore, Baltimore, before 1839 (as Beattie's Minstrel)William Gibson Borland family, Concord, Massachusetts, 1944Victor Spark (dealer), New York, 1944.DIA in 1944 (gift of Dexter M. Ferry, Jr.)
John Banister, Newport, Rhode Island, 1748-67; his son, John Bannister H. Newport, ca. 1767-1803; his brother, Thomas Banister, Lawrence, New York, 1803-15; his daughter, Alice Hermione Pelham Banister McNeil, Lawrence, 1815-23 Thomas Hewlett, Lawrence, 1823-41; Mary Hewlett, Lawrence, 1841( )-1870( ); James Hewlett, Lawrence, 1870-90; Mary Sanderson Hewlett, Lawrence, 1890-1917; George Hewlett, Brooklyn, 1917 to at least 1931.Stephen C. Clark, New York, to ca. 1944William MacBeth, Inc., New York, 1944.Acquired in 1944
Formerly in the collection of:The sitter; his eldest daughter, Lucinda Dorr, Dorchester, Massachusetts, 1825; her daughter, Sarah Whitney Davis Dorr Lemist, Roxbury, Massachusetts, 1843; her daughter, Frances Ann Lemist Wheelock, Roxbury, 1915.  Bought by another of the sitter's great-granddaughters, Ann Lothrop Motley Winthrop, Boston 1915; her niece, Maria Davis Motley Park, Groton, Massachusetts, 1923.  Bought by William H. Murphy, the sitter's great-great grandson, Detroit, 1927; his daughter, Mrs. J. Bell Moran, Detroit, 1945.Acquired in 1945.
Formerly in the collection of:  The artist; probably his daughter, Eleanor Peale Jacobs; probably her daughter; Mary Clare Jacobs Wirgman; her son, Grafton B. Wirgman, East Orange, New Jersey, 1923; probably his daughter, Carol Wirgman, East Orange, New Jersey. James Graham & Sons, New York 1941.Victor Spark (dealer), New York, 1945.Acquired in 1945.
Probably John Hone, New York, 1826Old Print Shop, New York, 1946DIA in 1946
A. F. Mondshein.  Acquired in 1946.
The artist, Hillsdale, Mich., 1873, until 1904.  His daughter, Ellen E. Gardner (Mrs. H. C.) Miller, until 1946.  Acquired in 1946.
William HarnettBirch's Auction Rooms, Philadelphia (from Harnett estate sale, February 22-23, 1893) Downtown Gallery, New YorkRobert Tannahill (purchased on March 21, 1941)DIA in 1946
Artist sold to Samuel Untermyer, New York, 1892; Untermyer family's sale, Parke-Bernet, New York, May 10, 1940, lot 29.Charles Sessler, Knoedler, New York.Scott and Fowles, New York, 1946Acquired in 1946
Noel Desanfans, before 1786Sale, Christie's, London, April 8, 1786, lot 396W. Goddard, by 1791Sale, Christie's, February 5, 1791, lot 73, sold to GreenG. P. Anderson, London W. P. Hunter, London, ca. 1850M. Knoedler Co., London, 1946DIA in 1946
Mrs. R. O'Hair,  Detroit.Acquired in 1947.
Baruch Feldman, Philadelphia.  Thompson Galleries, Detroit.  Acquired in 1947.
James Carr, New York.Inherited by granddaughter, Mrs. Clarence Crocker, East Orange, N.J.  On consignment with Ferargil Galleries, New York.  On consignment with Kleemann Galleries, New York, 1936.  Stephen C. Clark, 1937.  On consignment with Macbeth Gallery, New York.  Acquired in 1947.
Formerly in the collection of:  Albert Rosenthal, PhiladelphiaFeragil Galleries, New York, 1936William Macbeth, Inc., New York, 1936037Francis P. Garvan, New York, 1937; (Mrs. Francis P. Garvan 1948 )William Macbeth, Inc., 1948Acquired in 1948.
Descended in the family of Mary Hirst Pepperrell.[Goodspeed Bookstore, Boston]Childs Gallery, BostonOld Print Shop, New YorkDexter M. Ferry, Jr., DetroitAcquired in 1948
Formerly in the collection of:The Trumbull family, until 1867.Descended in an English aristocratic family, 1867-1948Harry Shaw Newman (dealer), New York, 1948Acquired in 1948.
Formerly in the collection of:The Trumbull family, until 1867.Descended in an English aristocratic family, 1867-1948Harry Shaw Newman (dealer), New York, 1948Acquired in 1948.
Robert H. TannahillDIA in 1948.
Artist to Helen Lothrop PrallDIA in 1950.
H. Reed, 1851John J. Herrick, The Castle, Tarryton on the Hudson George T. Herrick, his son John B. Ingham, PittsburghThe Old Print Shop, New York, 1950DIA in 1950
John Rodger, Washington, D.C., 1858; descended in the Rodgers family, Washington, D.C.Victor D. Spark (dealer). New York, 1950.Acquired in 1950.
Col. Charles Erskine Scott  Wood, Portland, Oregon, ca. 1896 1903, delivered to Wood, 1918.Macbeth Gallery, New York, from John List Crawford and Other Collections Sale, Parke-Bernet, New York, February, 20-32, 1946, lot 58.Dr. Chester. J. Robertson, Pelham Manor, New York , Consigned by Robertston to Macbeth Gallery, New York, September 9, 1948.Acquired in 1950.
Commissioned by James T. Abbe, Holyoke, Massachusetts. Marvin Preson, 1893.  Charles Churchill family, 1918 C. W. Churchill, Charlie Churchill's sonDIA in 1950.
Formerly in the collection of: Peale Museum, Philadelphia; Augustin Runyon Peale, Jr.; Herbert Raphaelle Peale; Adele Peale Conway Edward A. Newman (dealer), Philadelphia, 1950Acquired in 1950
Inness executor's sale, Fifth Avenue Art Galleries, New York, February 12-14, 1895, no. 158.Cyrus McCormick.   His wife. Her nephew, B. E. Ford, Dearborn, Mich.Acquired in 1951
Formerly in the collections of: Knoedler, New York, 1951 Whitney Museum of American Art, 1950 Macbeth Gallery, 1931 Pascal M. Gatterdam, New York, 1931 Edward Ward McMahon, New York, 1929 Woolworth Baldwin Collection, American Art Association,      1927 Knoedler, 1927 Thomas R. Ball, New York, 1919 Frederick S. Gibbs, New York, 1904
John Singleton CopleyMrs. John Singleton CopleyLord Lyndhurst, (John Singleton Copley, Jr.,their son), LondonLyndhurst Sale, Christie's, London, March 5, 1864, lot 69.Issac J. W. Burnett, Rock Hall, Alnwick, Northumberland, EnglandJ. W. Burnett Sale, Christie's, London, May 23-24, 1928, lot 217. MannMann Sale, Christie's, London, February 24, 1951, lot 102.M. Knoedler Co., New York, 1951DIA in 1952.
N.J. Eaton, St. Louis, by 1864John J. Herrick, Tarrytown, New YorkGeorge T. Herrick, Tarrytown, New YorkJohn B. Ingham, PittsburghThe Old Print Shop, New York, 1952DIA in 1952.
The Tweedy family of Brooklyn Edith Gregor Halpert (dealer), New YorkDIA in 1953
Formerly in the collection of:The artist's daughter, Charlotte [later Mrs. William Loughton Smith]; her son, William Wragg Smith; his daughter, Elizabeth Adda [later Mrs. Charles Mayhew Phinney].  Purchased by H. A. Schindler, Charleston, S.C. Acquired in 1953
Artist's estate, 1905; Anna Richards (Mrs. William T.)     Brewster, daughter of the artist.National Academy of Design, 1952Acquired in 1953
Levy Galleries.Purchased by Conrad H. Smith, Grosse Pointe Farms, Mich.  By descent to Raymond C. Smith, Grosse Pointe Farms, Mich.  Acquired in 1953
John Singer Sargent,to Mme. Judith Gautier until 1918;bequeathed by Mme. Gautier to Mlle. Suzanne Meyer-Zundel, until 1934;purchased by Schoeller, Scott & Fowles, New York from Hotel Drouot sale ( Tableaux Modernes Appartenant a divers amateurs. . .Oeuvres de John-Singer Sargent ), lot 122, Paris,  on January 18, 1934 (no. 12, repr.). Listed as  Judith Gautier chez elle; sold to Julius H. Weitzer and E. J. Rousuck, New York, 1934;DIA in 1954 with funds provided by Mr. and Mrs. Ernest Kanzler.
Thomas Foster, Utica, N,Y., 1847-49William J. Hoppin, from 1849.The Hoppin Family.Argosy Gallery, New YorkDexter M. Ferry, Jr., Grosse Pointe, Mich.Acquired in 1955
The Allston Trust.  Acquired in 1955.
Possibly Augustus S. Bachelder, Boston.  Katherine French Rockwell, Shrewsbury, Mass. Acquired in 1956.
Formerly in the collection of: George Riddle, Cambridge, Mass.; Arunah S. A. Brady, Baltimore Mr. and Mrs. James Whitcomb, Balitmore.P. Gilbert Broculette, Staten Island, New YorkMr. and Mrs. James S. Whitcomb, Grosse Pointe, Mich.Acquired in 1956.
American Art UnionYoung Men's Mercantile Association, Cincinnati T. L. Ogden, New York A descendant of Ogden. John J. Bowden, Long Island, New York Douglas F. Roby, Ypsilanti, MichiganDIA in 1956
Formerly in the collections of: A. J. Halow,  traveling picture salesman,  until February 14, 1920.Purchased on that date by Conrad Smith, Detroit.Raymond C. Smith (son) DIA in 1956.
Elihu Vedder, to 1880.Wellesley College, Wellesley, Mass., 1880, Gift of Elisha S. Converse.Hirschl & Adler Galleries, New York.Acquired in 1957.
Formerly in the collection of: Paul Magriel, New York Acquired in 1957.
James W. Tillman (d. 1866).  His widow, Martha Conant(Mrs. Alpheus S. Williams) Tillman (d. 1903).  Her daughter Louise Tillman (Mrs. Samuel T. ) Carson, who placed the painting on loan at the museum on January 31, 1905.DIA in 1957.
Formerly in the collection of:S. Lendall Pitts, Paris; Mrs. S. Lendall Pitts, Norfolk, Virginia, by 1949.On Loan to Mrs. Arthur Maxwll Parker, Grosse Pointe Farms, Michigan.Acquired in 1958.
Elizabeth Bowdoin, the sitter's daughter (Mrs. James Pitts), Boston; S. Lendall Pitts (her great-great-great-grandson), Detroit; Mrs. S. Lendall Pitts, Norfolk, Virginia.DIA in 1958, Founders Society Purchase, Gibbs-William Fund
James Pitts, Boston, to 1776;  John Pitts, Tyngsborough, Massachusetts (his son); Thomas Pitts, Detroit, (his great-grand nephew); Mrs. Thomas Pitts, Detroit;  S. Lendall Pitts, Detroit, (her son);Mrs. S. Lendall Pitts, Norfolk, Virginia.DIA in 1958
James Pitts (the sitter), Boston, to 1776; John Pitts (his son), Tyngsborough, Massachusetts; Thomas Pitts (his great grandnephew), Detroit; Mrs. Thomas Pitts, Detroit; S. Lendall Pitts (her son), Detroit; Mrs. S. Lendall Pitts, Norfolk, Virginia.  DIA in 1958.
Jonathan Mountfort, Boston, ca. 1753-85; Mrs. Thomas Pitts [Elizabeth Mountfort], Boston ( ), (his daughter); Sarah Pitts Farlin, Detroit, by 1883 (her daughter); S. Lendall Pitts, Detroit, by 1938 (her great nephew); Mrs. S. Lendall Pitts, Norfolk, Virginia.DIA in 1958
Private collection, Philadelphia.(Dealer), Philadelphia.Joe Kindig, Jr., & Son, York, Pennsylvania, 1958.Acquired in 1958.
Formerly in the collection of:  David Whitney, DetroitWayne County Medical Society, DetroitAcquired in 1959.
Clarence S. Congdon, Detroit.Mrs. Janet Ehnes.Acquired in 1959.
Dexter M. Ferry, Jr., Grosse Pointe, Michigan.  DIA in 1960, by bequest.
Formerly in the collection of: General Christopher Gadsden, Charleston, S. C. Christopher Gadsden, his grandson Miss Hume (Mrs. Frederick Wentworth Ford, niece of Christopher Gadsden Morris) Mrs. Lewis S. Jervey, daughter of Mrs. Ford T. B. Clarke Knoedler and Co. Senator James Couzens, Washington, D.C., and Detroit, ca. 1930; Mrs. James Couzens, Detroit.Acquired in 1961.
Amelia Elizabeth White, Santa Fe, New MexicoDIA in 1961
Vose Galleries, Boston.  Kennedy Galleries, New York.DIA in 1961.
Formerly in the collection of:The artist's grandson ( )Augustus Runyon PealeRalph L. ParkinsonDr. and Mrs. Irving Levitt, Bloomfield Hills, MichiganAcquired in 1963
Formerly in the collection of: The sitter, Mrs Charles Carroll, Annapolis, Maryland, 1753 54-61; her son Charles Carroll, 1761-1832; his great-grandson, Charles Carroll McTavish, 1832-68; his daughter, Virginia Scott McTavish, 1868-1917; her brother, Charles Carroll McTavish, 1917-47; great-great-great-grandson, Charles Bancroft Carroll, 1947-64.Kennedy Galleries, New York, 1964-66.Acquired in 1966
Howard Young Gallery, New York, ca. 1927-28.Alfred J. Fisher.Acquired in 1967.
Raymond C. Smith.Acquired in 1967
The artist's family until 1927. Gordon Beers, Gordon Galleries to Raymond C. Smith, 1927.Gift of Raymond C. Smith to DIA in 1967.
Van Loan family, Athens, N.Y.Hirschl & Adler Galleries, New York.Acquired in 1968.
The artist's heirs, 1822William McNeil, Tappan, New YorkKennedy Galleries, New York, 1967Acquired in 1968
Gari MelchersThe Mr. and Mrs. Charles Swift family, Middlebury, Vermont. DIA in 1969.
Formerly in the collection of:  O. Lagrange LaDueOliver Ladew, Baltimore; Pascal Gatterdam, New York. Macbeth Galleries (dealer), New York.Robert H. TannahillAcquired in 1970.
The Family of Colonel LewisSale, Sotheby's, London, November 19, 1969, lot 42Leger Galleries, Ltd., London, 1969DIA in 1970
Dealer, Redhill Surrey, EnglandLeger Galleris, London, 1967-70DIA in 1970
Chicago Art MarketRaymond L. McKanny, Douglas, Mich.DiA in 1970.
Theodore Robinson (Robinson estate sale, American Art Association, New York, 1898, no. 41, as NORMANDY FARM)J.E. Cowdin, 1898Mrs. Gertrude Cowdin Thaw, Cowdin et al Sale, American Art Association, New York, May 9, 1916, no. 50 (sold as FARM HOUSE AND RICK)Colonel Frank J. Hecker, 1916Mr. and Mrs. Christian Hecker (Col. Hecker's son)DIA in 1970
Formerly in the collection of: John Wilson, European Museum (dealer), London, 1819.Sir John Fleming Leicester, Bt. [later the first Lord de Tabley], London, 1819.Leicester sale, Christie's, London, July 7, 1827, lot 45, bought by Jackson.Given by Mrs. Newton Jackson to Radley College, Oxfordshire, 1906.Sale, Phillip, Son and Neale, London, April 6, 1970, lot P90.Leger Galleries, London.Acquired in 1970.
Hannah Loring, 1763-1785,Hannah Winslow de Paiba (her daughter),Mrs. L. G. M. Temple (her daughter), Toronto,L. G. M. Temple, TorontoWilliam Caleb Loring, Boston, 1893Augustus P. Loring (his nephew), Boston, 1938William Caleb Loring, Prides Crossing, Massachusetts, by 1966Kennedy Galleries, New York, 1970DIA in 1970.
Augustus Eliott Fuller, descendant, Rose Hill Park, Sussex, by 1846Decended indirectly in the sitter's family to Sir George Eliott Meyrick Tapps-Gervis, Bt., Hinton Admiral Hampshire, ca. 1876;Sir George D. Eliott Tapps-Gervis-Meyrick, Bt. (his great-grandson), 1970Sale, Christies, London, May 13, 1970, no. 99Leger Galleries, London, 1970DiA in 1970.
Mary Boylston Hallowell (the sitter)Mary Hallowell Elmsley (her daughter)Mary Elmsley Bond (her daughter)Elizabeth Bond Coke (her daughter)George Elmsley Coke (her son)Basil Elmsley Coke (his son)Mrs. A. R. (Cassandra Coke) Wise (his daughter)Adam Nugent Wise (her son)Leger Galleries, London, 1971DIA in 1971.
Robert Charles Hall.  Gift of his daughter, Elizabeth Hall, and her sister, to the Peabody Institute, Baltimore, 1924.Kennedy Galleries, New York 1964.  Mr. and Mrs. Harold O. Love, 1964-72.Acquired in 1972
General Brayton Ives, new York, from 1890.Mr. and Mrs. John Droska, Detroit, 1957-59Mr. and Mrs. William Kahlich, Detroit, 1959-66Mr. and Mrs. James O. Keene, Birmingham, Mich., 1966-72.Acquired in 1972.
Colonel Frank J. Hecker, Detroit, ca. 1898; to unknown Grosse Pointe, Michigan, patron; to unknown Royal Oak, Michigan, patron; to George Heckroth, dealer; toMr. and Mrs.  James O. Keene; to DIA in 1972.
Mr. Marvin SimonsMrs. Helen L. DeRoy, Detroit, Michigan. DIA in 1972.
Caroline Hunt Rimmer.Unidentified male operator of horse-rental establishment near South Station, Boston, who lived in Lexington, Mass.Miss Florence M.  Young and unidentified older sister, 1920s.Miss Florence M. Young, West Roxbury, Mass. Mrs. Kingsbury, Medfield, Mass., ca. 1961-mid-1970.Vose Galleries, Boston.Dr. and Mrs. Sheldon Stern, Franklin, Mich.Acquired in 1973
William Brand, 1865.Sotheby and Company, London, 1971.Meredith Long and Company, Houston, Texas, 1972.DIA in 1973.
John Singer Sargent;to sitter, Semourina;Seymourina Cuthbert Poirson to her daughter-in-law, Madame Charles Poirson;Mme. Poirson to her son, Gerard Poirson, until 1972; to Newhouse Galleries until 1973;DIA in 1973.
Myron BarlowJacob and Rosalie Siegel (purchased directly from the artist on 22 March 1919). Sold to Mr. and Mrs. Bernard Walker, 1975. DIA in 1975
James W.  Pinchot, New York and Washington, D.C., ca. 1862-66 until 1908.Governor Gifford Pinchot.Mr. Gifford Pinchot, until 1975.Hirschl & Adler Galleries, New York.Acquired in 1975.
Vose Galleries, BostonAcquired in 1975.
James Lenox (It was commissioned by him),  New York, 1862-80.  Lenox Library (later New York Public Library), New York, 1880-1945. M. Knoedler and Co., New York, 1945 John Astor, Miami, Florida (He was a descendent of Lenox),  New York, 1945-76.Hirschl & Adler Galleries, New York, 1976.DIA in 1976.
Formerly in the collection of: William Beckford, Bath, by 1838; his daughter Euphemia, wife of the tenth Duke ofHamilton; the twelfth Duke of Hamilton.  Hamilton Palace sale, Christies, London, June 17-July 20, 1882, lot 1068.H. Graves and Co. (dealers), London.Thomas B. Walker, Minneapolis, 1909.Harry W. Peterson, 1937.Frank Gunter, Champaign, Illinois, 1977.Acquired in 1977.
Kennedy Galleries, New York, 1960Harold O. Love, Grosse Pointe Woods, MichiganAcquired in 1977
H.  H.  Leeds and Miner,  and H. W. Derby, 1867.Frank Johnston Jones. University of Cincinnati, Ohio, 1928-77.Hirschl & Adler, New  York.DIA in 1978.
Formerly in the collection of: Possibly  Henry Thomson, R. A., London.George Wyndham, third Earl of Egremont, Petworth House, Sussex, by 1820;John Wyndham, seventh Baron Leconfield and second Baron Egremont.Wyndham sale, Sotheby's, London, July 19, 1978, lot 18.P. and D. Colnaghi (dealer), London.Acquired in 1979.
Commissioned by George III and presented by him in 1786 to Saint George's Chapel, Windsor.Sale, Dean and Canons of Windsor, Sotheby's, London, June 2, 1978, lot 132.Somerville and Simpson (dealer), London, and P. and D. Colnaghi (dealer), London.Acquired in 1980.
George Abraham and Gilbert May Antiques, 1961 Edgar William and Bernice Chrysler Garbisch, New York.DIA in 1981.
Mrs. John White AlexanderIrina A. Reed, New York (grandaughter of John White Alexander)Graham Galleries, New YorkDIA in 1982
Acquired in 1883.
Formerly in the collection of:G. Q. Cotton, Philadelphia, 1858S. A. Coale (dealer), St. Louis, 1885George H. Scripps, Detroit, 1885.Acquired in 1885.
DMA purchase from artist, from Merrill Hall Exhibition proceeds.
DIA in 1888.
Purchased by subscription through the efforts of Mrs. E. C. Skinner and Mrs. H. P. Jenkins and presented to the museum. Purchased from the artist.
The artist to DIA, 1889.  File says that the painting was  to be taken from Mr. Brearley,  so he apparently purchased it for the museum and was later reimbursed. Purchased from artist.
Thomas Hankey sale, Christie's, London, June 7-8, 1799, lot 20.John Willett sale, Peter Coxe, London, June 1, 1813, lot 79.James E. Scripps, Detroit.Acquired in 1889.
Witenagemote Club, purchased in 1889 as a giftDIA in 1889..
Samuel Richards (the artist)Bela Hubbard (purchased it for $3,000)DMA in 1892.
By descent to the sitter's wife.Acquired in 1896
Purchased directly from the artist and was the first purchase made by the DMA Artists' Fund. Painting had been part of the  Third Annual Exhibition of the Society of Western Artists. 
C.J. Glascow Company, Detroit.  Acquired as a gift in 1968.
The sitter's son John Newbury Bagley.  His daughterFrances Bagley Wallace.  Mrs. James K. Watkins.Acquired in 1977.